{
  "config": [
    {
      "config": {
        "nb_filter": 256,
        "b_constraint": null,
        "activity_regularizer": null,
        "activation": "relu",
        "input_dtype": "float32",
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "input_dim": 4,
        "filter_length": 3,
        "bias": true,
        "W_regularizer": null,
        "border_mode": "valid",
        "name": "convolution1d_1",
        "b_regularizer": null,
        "W_constraint": null,
        "trainable": true,
        "subsample_length": 1,
        "init": "lecun_uniform",
        "input_length": 1000
      },
      "class_name": "Convolution1D"
    },
    {
      "config": {
        "stride": 2,
        "border_mode": "valid",
        "name": "maxpooling1d_1",
        "pool_length": 2,
        "trainable": true
      },
      "class_name": "MaxPooling1D"
    },
    {
      "config": {
        "name": "dropout_1",
        "p": 0.7,
        "trainable": true
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "nb_filter": 512,
        "b_constraint": null,
        "activity_regularizer": null,
        "activation": "relu",
        "input_dtype": "float32",
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "input_dim": 4,
        "filter_length": 5,
        "bias": true,
        "W_regularizer": null,
        "border_mode": "valid",
        "name": "convolution1d_2",
        "b_regularizer": null,
        "W_constraint": null,
        "trainable": true,
        "subsample_length": 1,
        "init": "lecun_uniform",
        "input_length": 1000
      },
      "class_name": "Convolution1D"
    },
    {
      "config": {
        "stride": 2,
        "border_mode": "valid",
        "name": "maxpooling1d_2",
        "pool_length": 2,
        "trainable": true
      },
      "class_name": "MaxPooling1D"
    },
    {
      "config": {
        "nb_filter": 512,
        "b_constraint": null,
        "activity_regularizer": null,
        "activation": "relu",
        "input_dtype": "float32",
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "input_dim": 4,
        "filter_length": 5,
        "bias": true,
        "W_regularizer": null,
        "border_mode": "valid",
        "name": "convolution1d_3",
        "b_regularizer": null,
        "W_constraint": null,
        "trainable": true,
        "subsample_length": 1,
        "init": "lecun_uniform",
        "input_length": 1000
      },
      "class_name": "Convolution1D"
    },
    {
      "config": {
        "stride": 2,
        "border_mode": "valid",
        "name": "maxpooling1d_3",
        "pool_length": 2,
        "trainable": true
      },
      "class_name": "MaxPooling1D"
    },
    {
      "config": {
        "name": "dropout_2",
        "p": 0.2,
        "trainable": true
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "layer": {
          "config": {
            "inner_activation": "hard_sigmoid",
            "unroll": false,
            "input_dtype": "float32",
            "go_backwards": false,
            "batch_input_shape": [
              null,
              null,
              320
            ],
            "input_dim": 512,
            "U_regularizer": null,
            "forget_bias_init": "one",
            "b_regularizer": null,
            "W_regularizer": null,
            "dropout_U": 0.0,
            "stateful": false,
            "activation": "tanh",
            "output_dim": 320,
            "inner_init": "orthogonal",
            "return_sequences": true,
            "dropout_W": 0.0,
            "consume_less": "cpu",
            "trainable": true,
            "name": "forward_forward_lstm_1",
            "input_length": null,
            "init": "glorot_uniform"
          },
          "class_name": "LSTM"
        },
        "name": "bidirectional_1",
        "merge_mode": "concat",
        "trainable": true
      },
      "class_name": "Bidirectional"
    },
    {
      "config": {
        "name": "dropout_3",
        "p": 0.5,
        "trainable": true
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "name": "flatten_1",
        "trainable": true
      },
      "class_name": "Flatten"
    },
    {
      "config": {
        "W_regularizer": null,
        "activation": "relu",
        "output_dim": 1024,
        "batch_input_shape": [
          null,
          4096
        ],
        "input_dim": 77440,
        "bias": true,
        "trainable": true,
        "W_constraint": null,
        "b_regularizer": null,
        "name": "dense_1",
        "activity_regularizer": null,
        "b_constraint": null,
        "init": "glorot_uniform",
        "input_dtype": "float32"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "name": "dropout_4",
        "p": 0.5,
        "trainable": true
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "W_regularizer": null,
        "activation": "sigmoid",
        "output_dim": 919,
        "batch_input_shape": [
          null,
          1024
        ],
        "input_dim": 1024,
        "bias": true,
        "trainable": true,
        "W_constraint": null,
        "b_regularizer": null,
        "name": "dense_2",
        "activity_regularizer": null,
        "b_constraint": null,
        "init": "glorot_uniform",
        "input_dtype": "float32"
      },
      "class_name": "Dense"
    }
  ],
  "class_name": "Sequential",
  "keras_version": "1.2.1"
}