{
  "config": [
    {
      "config": {
        "input_length": 1000,
        "name": "convolution1d_1",
        "subsample_length": 1,
        "nb_filter": 256,
        "b_regularizer": null,
        "W_constraint": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "activation": "relu",
        "bias": true,
        "init": "lecun_uniform",
        "trainable": true,
        "input_dim": 4,
        "b_constraint": null,
        "W_regularizer": null,
        "border_mode": "valid",
        "input_dtype": "float32",
        "activity_regularizer": null,
        "filter_length": 3
      },
      "class_name": "Convolution1D"
    },
    {
      "config": {
        "stride": 2,
        "border_mode": "valid",
        "name": "maxpooling1d_1",
        "trainable": true,
        "pool_length": 2
      },
      "class_name": "MaxPooling1D"
    },
    {
      "config": {
        "name": "dropout_1",
        "trainable": true,
        "p": 0.7
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "input_length": 1000,
        "name": "convolution1d_2",
        "subsample_length": 1,
        "nb_filter": 512,
        "b_regularizer": null,
        "W_constraint": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "activation": "relu",
        "bias": true,
        "init": "lecun_uniform",
        "trainable": true,
        "input_dim": 4,
        "b_constraint": null,
        "W_regularizer": null,
        "border_mode": "valid",
        "input_dtype": "float32",
        "activity_regularizer": null,
        "filter_length": 5
      },
      "class_name": "Convolution1D"
    },
    {
      "config": {
        "stride": 2,
        "border_mode": "valid",
        "name": "maxpooling1d_2",
        "trainable": true,
        "pool_length": 2
      },
      "class_name": "MaxPooling1D"
    },
    {
      "config": {
        "input_length": 1000,
        "name": "convolution1d_3",
        "subsample_length": 1,
        "nb_filter": 512,
        "b_regularizer": null,
        "W_constraint": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "activation": "relu",
        "bias": true,
        "init": "lecun_uniform",
        "trainable": true,
        "input_dim": 4,
        "b_constraint": null,
        "W_regularizer": null,
        "border_mode": "valid",
        "input_dtype": "float32",
        "activity_regularizer": null,
        "filter_length": 5
      },
      "class_name": "Convolution1D"
    },
    {
      "config": {
        "stride": 2,
        "border_mode": "valid",
        "name": "maxpooling1d_3",
        "trainable": true,
        "pool_length": 2
      },
      "class_name": "MaxPooling1D"
    },
    {
      "config": {
        "name": "flatten_1",
        "trainable": true
      },
      "class_name": "Flatten"
    },
    {
      "config": {
        "name": "dense_1",
        "activity_regularizer": null,
        "init": "glorot_uniform",
        "W_constraint": null,
        "bias": true,
        "b_regularizer": null,
        "trainable": true,
        "input_dim": 61952,
        "b_constraint": null,
        "W_regularizer": null,
        "activation": "relu",
        "input_dtype": "float32",
        "output_dim": 1024,
        "batch_input_shape": [
          null,
          4096
        ]
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "name": "dropout_2",
        "trainable": true,
        "p": 0.5
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "name": "dense_2",
        "activity_regularizer": null,
        "init": "glorot_uniform",
        "W_constraint": null,
        "bias": true,
        "b_regularizer": null,
        "trainable": true,
        "input_dim": 1024,
        "b_constraint": null,
        "W_regularizer": null,
        "activation": "sigmoid",
        "input_dtype": "float32",
        "output_dim": 919,
        "batch_input_shape": [
          null,
          1024
        ]
      },
      "class_name": "Dense"
    }
  ],
  "class_name": "Sequential",
  "keras_version": "1.2.1"
}