{
  "keras_version": "1.2.1",
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Convolution1D",
      "config": {
        "border_mode": "valid",
        "subsample_length": 1,
        "init": "he_normal",
        "activity_regularizer": null,
        "activation": "linear",
        "b_constraint": null,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "input_dim": 4,
        "input_length": 1000,
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "trainable": true,
        "nb_filter": 64,
        "bias": true,
        "filter_length": 3,
        "name": "convolution1d_1"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_1",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "mode": 0,
        "trainable": true,
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "axis": -1,
        "name": "batchnormalization_1"
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "border_mode": "valid",
        "subsample_length": 1,
        "init": "he_normal",
        "activity_regularizer": null,
        "activation": "linear",
        "b_constraint": null,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "input_dim": 4,
        "input_length": 1000,
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "trainable": true,
        "nb_filter": 64,
        "bias": true,
        "filter_length": 3,
        "name": "convolution1d_2"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_2",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "mode": 0,
        "trainable": true,
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "axis": -1,
        "name": "batchnormalization_2"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_1",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "border_mode": "valid",
        "name": "maxpooling1d_1",
        "trainable": true,
        "pool_length": 2,
        "stride": 2
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "border_mode": "valid",
        "subsample_length": 1,
        "init": "he_normal",
        "activity_regularizer": null,
        "activation": "linear",
        "b_constraint": null,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "input_dim": 4,
        "input_length": 1000,
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "trainable": true,
        "nb_filter": 128,
        "bias": true,
        "filter_length": 3,
        "name": "convolution1d_3"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_3",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "mode": 0,
        "trainable": true,
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "axis": -1,
        "name": "batchnormalization_3"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_2",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "border_mode": "valid",
        "subsample_length": 1,
        "init": "he_normal",
        "activity_regularizer": null,
        "activation": "linear",
        "b_constraint": null,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "input_dim": 4,
        "input_length": 1000,
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "trainable": true,
        "nb_filter": 128,
        "bias": true,
        "filter_length": 3,
        "name": "convolution1d_4"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_4",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "mode": 0,
        "trainable": true,
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "axis": -1,
        "name": "batchnormalization_4"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_3",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "border_mode": "valid",
        "name": "maxpooling1d_2",
        "trainable": true,
        "pool_length": 2,
        "stride": 2
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "border_mode": "valid",
        "subsample_length": 1,
        "init": "he_normal",
        "activity_regularizer": null,
        "activation": "linear",
        "b_constraint": null,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "input_dim": 4,
        "input_length": 1000,
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "trainable": true,
        "nb_filter": 256,
        "bias": true,
        "filter_length": 3,
        "name": "convolution1d_5"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_5",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "mode": 0,
        "trainable": true,
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "axis": -1,
        "name": "batchnormalization_5"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_4",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "border_mode": "valid",
        "subsample_length": 1,
        "init": "he_normal",
        "activity_regularizer": null,
        "activation": "linear",
        "b_constraint": null,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "input_dim": 4,
        "input_length": 1000,
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "trainable": true,
        "nb_filter": 256,
        "bias": true,
        "filter_length": 3,
        "name": "convolution1d_6"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_6",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "mode": 0,
        "trainable": true,
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "axis": -1,
        "name": "batchnormalization_6"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_5",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "border_mode": "valid",
        "subsample_length": 1,
        "init": "he_normal",
        "activity_regularizer": null,
        "activation": "linear",
        "b_constraint": null,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "input_dim": 4,
        "input_length": 1000,
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "trainable": true,
        "nb_filter": 256,
        "bias": true,
        "filter_length": 3,
        "name": "convolution1d_7"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_7",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "mode": 0,
        "trainable": true,
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "axis": -1,
        "name": "batchnormalization_7"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_6",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "border_mode": "valid",
        "name": "maxpooling1d_3",
        "trainable": true,
        "pool_length": 2,
        "stride": 2
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "border_mode": "valid",
        "subsample_length": 1,
        "init": "he_normal",
        "activity_regularizer": null,
        "activation": "linear",
        "b_constraint": null,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "input_dim": 4,
        "input_length": 1000,
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "trainable": true,
        "nb_filter": 512,
        "bias": true,
        "filter_length": 3,
        "name": "convolution1d_8"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_8",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "mode": 0,
        "trainable": true,
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "axis": -1,
        "name": "batchnormalization_8"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_7",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "border_mode": "valid",
        "subsample_length": 1,
        "init": "he_normal",
        "activity_regularizer": null,
        "activation": "linear",
        "b_constraint": null,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "input_dim": 4,
        "input_length": 1000,
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "trainable": true,
        "nb_filter": 512,
        "bias": true,
        "filter_length": 3,
        "name": "convolution1d_9"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_9",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "mode": 0,
        "trainable": true,
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "axis": -1,
        "name": "batchnormalization_9"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_8",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "border_mode": "valid",
        "subsample_length": 1,
        "init": "he_normal",
        "activity_regularizer": null,
        "activation": "linear",
        "b_constraint": null,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "input_dim": 4,
        "input_length": 1000,
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "trainable": true,
        "nb_filter": 512,
        "bias": true,
        "filter_length": 3,
        "name": "convolution1d_10"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_10",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "mode": 0,
        "trainable": true,
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "axis": -1,
        "name": "batchnormalization_10"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_9",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "border_mode": "valid",
        "name": "maxpooling1d_4",
        "trainable": true,
        "pool_length": 2,
        "stride": 2
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten_1",
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          4096
        ],
        "activation": "linear",
        "b_constraint": null,
        "output_dim": 1024,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "activity_regularizer": null,
        "init": "he_normal",
        "input_dim": 29184,
        "trainable": true,
        "bias": true,
        "name": "dense_1"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_11",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "mode": 0,
        "trainable": true,
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "beta_regularizer": null,
        "axis": -1,
        "name": "batchnormalization_11"
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_10",
        "p": 0.5,
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "W_regularizer": null,
        "batch_input_shape": [
          null,
          1024
        ],
        "activation": "linear",
        "b_constraint": null,
        "output_dim": 919,
        "W_constraint": null,
        "b_regularizer": null,
        "input_dtype": "float32",
        "activity_regularizer": null,
        "init": "he_normal",
        "input_dim": 1024,
        "trainable": true,
        "bias": true,
        "name": "dense_2"
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_12",
        "activation": "sigmoid",
        "trainable": true
      }
    }
  ]
}