{
  "keras_version": "1.2.2",
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Convolution1D",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "subsample_length": 1,
        "activation": "linear",
        "input_dtype": "float32",
        "border_mode": "valid",
        "activity_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "input_length": 1000,
        "filter_length": 3,
        "init": "he_normal",
        "W_regularizer": null,
        "name": "convolution1d_1",
        "W_constraint": null,
        "input_dim": 4,
        "bias": true,
        "nb_filter": 64,
        "trainable": true
      }
    },
    {
      "class_name": "PReLU",
      "config": {
        "init": "zero",
        "name": "prelu_1",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "beta_regularizer": null,
        "name": "batchnormalization_1",
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "subsample_length": 1,
        "activation": "linear",
        "border_mode": "valid",
        "activity_regularizer": null,
        "input_length": null,
        "filter_length": 3,
        "init": "he_normal",
        "W_regularizer": null,
        "name": "convolution1d_2",
        "W_constraint": null,
        "input_dim": null,
        "bias": true,
        "nb_filter": 64,
        "trainable": true
      }
    },
    {
      "class_name": "PReLU",
      "config": {
        "init": "zero",
        "name": "prelu_2",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "beta_regularizer": null,
        "name": "batchnormalization_2",
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "subsample_length": 2,
        "activation": "linear",
        "border_mode": "valid",
        "activity_regularizer": null,
        "input_length": null,
        "filter_length": 3,
        "init": "he_normal",
        "W_regularizer": null,
        "name": "convolution1d_3",
        "W_constraint": null,
        "input_dim": null,
        "bias": true,
        "nb_filter": 128,
        "trainable": true
      }
    },
    {
      "class_name": "PReLU",
      "config": {
        "init": "zero",
        "name": "prelu_3",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "beta_regularizer": null,
        "name": "batchnormalization_3",
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_1",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "subsample_length": 2,
        "activation": "linear",
        "border_mode": "valid",
        "activity_regularizer": null,
        "input_length": null,
        "filter_length": 3,
        "init": "he_normal",
        "W_regularizer": null,
        "name": "convolution1d_4",
        "W_constraint": null,
        "input_dim": null,
        "bias": true,
        "nb_filter": 128,
        "trainable": true
      }
    },
    {
      "class_name": "PReLU",
      "config": {
        "init": "zero",
        "name": "prelu_4",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "beta_regularizer": null,
        "name": "batchnormalization_4",
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_2",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "subsample_length": 2,
        "activation": "linear",
        "border_mode": "valid",
        "activity_regularizer": null,
        "input_length": null,
        "filter_length": 5,
        "init": "he_normal",
        "W_regularizer": null,
        "name": "convolution1d_5",
        "W_constraint": null,
        "input_dim": null,
        "bias": true,
        "nb_filter": 256,
        "trainable": true
      }
    },
    {
      "class_name": "PReLU",
      "config": {
        "init": "zero",
        "name": "prelu_5",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "beta_regularizer": null,
        "name": "batchnormalization_5",
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_3",
        "p": 0.2,
        "trainable": true
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "subsample_length": 2,
        "activation": "linear",
        "border_mode": "valid",
        "activity_regularizer": null,
        "input_length": null,
        "filter_length": 5,
        "init": "he_normal",
        "W_regularizer": null,
        "name": "convolution1d_6",
        "W_constraint": null,
        "input_dim": null,
        "bias": true,
        "nb_filter": 256,
        "trainable": true
      }
    },
    {
      "class_name": "PReLU",
      "config": {
        "init": "zero",
        "name": "prelu_6",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "beta_regularizer": null,
        "name": "batchnormalization_6",
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten_1",
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "activation": "linear",
        "input_dtype": "float32",
        "activity_regularizer": null,
        "batch_input_shape": [
          null,
          4096
        ],
        "output_dim": 1024,
        "init": "he_normal",
        "W_regularizer": null,
        "name": "dense_1",
        "W_constraint": null,
        "input_dim": 15104,
        "bias": true,
        "trainable": true
      }
    },
    {
      "class_name": "PReLU",
      "config": {
        "init": "zero",
        "name": "prelu_7",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "momentum": 0.99,
        "beta_regularizer": null,
        "name": "batchnormalization_7",
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_4",
        "p": 0.5,
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "activation": "linear",
        "input_dtype": "float32",
        "activity_regularizer": null,
        "batch_input_shape": [
          null,
          1024
        ],
        "output_dim": 919,
        "init": "he_normal",
        "W_regularizer": null,
        "name": "dense_2",
        "W_constraint": null,
        "input_dim": 1024,
        "bias": true,
        "trainable": true
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "activation": "sigmoid",
        "name": "activation_1",
        "trainable": true
      }
    }
  ]
}