{
  "class_name": "Sequential",
  "keras_version": "1.2.2",
  "config": [
    {
      "class_name": "Convolution1D",
      "config": {
        "name": "convolution1d_1",
        "b_constraint": null,
        "border_mode": "valid",
        "filter_length": 3,
        "b_regularizer": null,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "nb_filter": 64,
        "subsample_length": 1,
        "activation": "linear",
        "input_dim": 4,
        "W_regularizer": null,
        "input_dtype": "float32",
        "bias": true,
        "init": "he_normal",
        "W_constraint": null,
        "trainable": true,
        "activity_regularizer": null,
        "input_length": 1000
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_1",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "momentum": 0.99,
        "name": "batchnormalization_1",
        "beta_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "pool_length": 2,
        "name": "maxpooling1d_1",
        "trainable": true,
        "stride": 2,
        "border_mode": "valid"
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "border_mode": "valid",
        "filter_length": 3,
        "bias": true,
        "nb_filter": 64,
        "subsample_length": 1,
        "activation": "linear",
        "input_dim": null,
        "W_regularizer": null,
        "name": "convolution1d_2",
        "W_constraint": null,
        "trainable": true,
        "init": "he_normal",
        "activity_regularizer": null,
        "input_length": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_2",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "momentum": 0.99,
        "name": "batchnormalization_2",
        "beta_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "border_mode": "valid",
        "filter_length": 3,
        "bias": true,
        "nb_filter": 128,
        "subsample_length": 1,
        "activation": "linear",
        "input_dim": null,
        "W_regularizer": null,
        "name": "convolution1d_3",
        "W_constraint": null,
        "trainable": true,
        "init": "he_normal",
        "activity_regularizer": null,
        "input_length": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_3",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "momentum": 0.99,
        "name": "batchnormalization_3",
        "beta_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "p": 0.2,
        "name": "dropout_1",
        "trainable": true
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "border_mode": "valid",
        "filter_length": 3,
        "bias": true,
        "nb_filter": 128,
        "subsample_length": 1,
        "activation": "linear",
        "input_dim": null,
        "W_regularizer": null,
        "name": "convolution1d_4",
        "W_constraint": null,
        "trainable": true,
        "init": "he_normal",
        "activity_regularizer": null,
        "input_length": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_4",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "momentum": 0.99,
        "name": "batchnormalization_4",
        "beta_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "p": 0.2,
        "name": "dropout_2",
        "trainable": true
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "pool_length": 2,
        "name": "maxpooling1d_2",
        "trainable": true,
        "stride": 2,
        "border_mode": "valid"
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "border_mode": "valid",
        "filter_length": 5,
        "bias": true,
        "nb_filter": 256,
        "subsample_length": 1,
        "activation": "linear",
        "input_dim": null,
        "W_regularizer": null,
        "name": "convolution1d_5",
        "W_constraint": null,
        "trainable": true,
        "init": "he_normal",
        "activity_regularizer": null,
        "input_length": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_5",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "momentum": 0.99,
        "name": "batchnormalization_5",
        "beta_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "p": 0.2,
        "name": "dropout_3",
        "trainable": true
      }
    },
    {
      "class_name": "Convolution1D",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "border_mode": "valid",
        "filter_length": 5,
        "bias": true,
        "nb_filter": 256,
        "subsample_length": 1,
        "activation": "linear",
        "input_dim": null,
        "W_regularizer": null,
        "name": "convolution1d_6",
        "W_constraint": null,
        "trainable": true,
        "init": "he_normal",
        "activity_regularizer": null,
        "input_length": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_6",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "p": 0.2,
        "name": "dropout_4",
        "trainable": true
      }
    },
    {
      "class_name": "Bidirectional",
      "config": {
        "name": "bidirectional_1",
        "merge_mode": "concat",
        "trainable": true,
        "layer": {
          "class_name": "LSTM",
          "config": {
            "go_backwards": false,
            "U_regularizer": null,
            "input_dtype": "float32",
            "stateful": false,
            "activation": "tanh",
            "init": "glorot_uniform",
            "input_dim": 320,
            "W_regularizer": null,
            "trainable": true,
            "inner_init": "orthogonal",
            "dropout_U": 0.0,
            "input_length": null,
            "return_sequences": true,
            "b_regularizer": null,
            "batch_input_shape": [
              null,
              null,
              320
            ],
            "unroll": false,
            "output_dim": 320,
            "inner_activation": "hard_sigmoid",
            "forget_bias_init": "one",
            "name": "lstm_1",
            "consume_less": "cpu",
            "dropout_W": 0.0
          }
        }
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "p": 0.5,
        "name": "dropout_5",
        "trainable": true
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten_1",
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "bias": true,
        "batch_input_shape": [
          null,
          4096
        ],
        "output_dim": 1024,
        "activation": "linear",
        "input_dim": 152320,
        "W_regularizer": null,
        "input_dtype": "float32",
        "name": "dense_1",
        "W_constraint": null,
        "trainable": true,
        "init": "he_normal",
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_7",
        "activation": "relu",
        "trainable": true
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "mode": 0,
        "axis": -1,
        "gamma_regularizer": null,
        "momentum": 0.99,
        "name": "batchnormalization_6",
        "beta_regularizer": null,
        "trainable": true,
        "epsilon": 0.001
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "p": 0.5,
        "name": "dropout_6",
        "trainable": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "b_regularizer": null,
        "b_constraint": null,
        "bias": true,
        "batch_input_shape": [
          null,
          1024
        ],
        "output_dim": 919,
        "activation": "linear",
        "input_dim": 1024,
        "W_regularizer": null,
        "input_dtype": "float32",
        "name": "dense_2",
        "W_constraint": null,
        "trainable": true,
        "init": "he_normal",
        "activity_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_8",
        "activation": "sigmoid",
        "trainable": true
      }
    }
  ]
}