{
  "config": [
    {
      "config": {
        "b_constraint": null,
        "input_dim": 4,
        "W_regularizer": null,
        "input_length": 1000,
        "init": "glorot_uniform",
        "filter_length": 26,
        "nb_filter": 320,
        "bias": true,
        "border_mode": "valid",
        "activity_regularizer": null,
        "W_constraint": null,
        "activation": "relu",
        "trainable": true,
        "subsample_length": 1,
        "batch_input_shape": [
          null,
          1000,
          4
        ],
        "input_dtype": "float32",
        "name": "convolution1d_1",
        "b_regularizer": null
      },
      "class_name": "Convolution1D"
    },
    {
      "config": {
        "pool_length": 13,
        "name": "maxpooling1d_1",
        "border_mode": "valid",
        "stride": 13,
        "trainable": true
      },
      "class_name": "MaxPooling1D"
    },
    {
      "config": {
        "merge_mode": "concat",
        "trainable": true,
        "name": "bidirectional_1",
        "layer": {
          "config": {
            "input_dim": 320,
            "inner_init": "orthogonal",
            "dropout_W": 0.2,
            "dropout_U": 0.5,
            "output_dim": 320,
            "b_regularizer": null,
            "input_length": null,
            "forget_bias_init": "one",
            "unroll": false,
            "name": "lstm_1",
            "U_regularizer": null,
            "W_regularizer": null,
            "init": "glorot_uniform",
            "return_sequences": true,
            "go_backwards": false,
            "inner_activation": "hard_sigmoid",
            "activation": "tanh",
            "trainable": true,
            "stateful": false,
            "batch_input_shape": [
              null,
              null,
              320
            ],
            "input_dtype": "float32",
            "consume_less": "cpu"
          },
          "class_name": "LSTM"
        }
      },
      "class_name": "Bidirectional"
    },
    {
      "config": {
        "name": "flatten_1",
        "trainable": true
      },
      "class_name": "Flatten"
    },
    {
      "config": {
        "b_constraint": null,
        "input_dim": 48000,
        "W_regularizer": null,
        "init": "glorot_uniform",
        "output_dim": 925,
        "bias": true,
        "activity_regularizer": null,
        "W_constraint": null,
        "activation": "linear",
        "trainable": true,
        "batch_input_shape": [
          null,
          48000
        ],
        "input_dtype": "float32",
        "name": "dense_1",
        "b_regularizer": null
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "name": "activation_1",
        "activation": "relu",
        "trainable": true
      },
      "class_name": "Activation"
    },
    {
      "config": {
        "b_constraint": null,
        "input_dim": 925,
        "W_regularizer": null,
        "init": "glorot_uniform",
        "output_dim": 919,
        "bias": true,
        "activity_regularizer": null,
        "W_constraint": null,
        "activation": "linear",
        "trainable": true,
        "batch_input_shape": [
          null,
          925
        ],
        "input_dtype": "float32",
        "name": "dense_2",
        "b_regularizer": null
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "name": "activation_2",
        "activation": "sigmoid",
        "trainable": true
      },
      "class_name": "Activation"
    }
  ],
  "class_name": "Sequential",
  "keras_version": "1.2.2"
}