{
  "keras_version": "1.2.2",
  "class_name": "Model",
  "config": {
    "output_layers": [
      [
        "fc1",
        0,
        0
      ]
    ],
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "input_dtype": "float32",
          "batch_input_shape": [
            null,
            1000,
            4
          ],
          "name": "input_part",
          "sparse": false
        },
        "name": "input_part",
        "inbound_nodes": []
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "linear",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 1,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": true,
          "b_constraint": null,
          "W_constraint": null,
          "name": "initial_causal_conv",
          "filter_length": 2,
          "W_regularizer": null,
          "subsample_length": 1
        },
        "name": "initial_causal_conv",
        "inbound_nodes": [
          [
            [
              "input_part",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "name": "dropout_1",
          "trainable": true
        },
        "name": "dropout_1",
        "inbound_nodes": [
          [
            [
              "initial_causal_conv",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "tanh",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 1,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_1_tanh_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_1_tanh_s0",
        "inbound_nodes": [
          [
            [
              "initial_causal_conv",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "sigmoid",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 1,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_1_sigm_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_1_sigm_s0",
        "inbound_nodes": [
          [
            [
              "dropout_1",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "gated_activation_0_s0",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "mul"
        },
        "name": "gated_activation_0_s0",
        "inbound_nodes": [
          [
            [
              "dilated_conv_1_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_1_sigm_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_1",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_1",
        "inbound_nodes": [
          [
            [
              "gated_activation_0_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "merge_1",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "sum"
        },
        "name": "merge_1",
        "inbound_nodes": [
          [
            [
              "initial_causal_conv",
              0,
              0
            ],
            [
              "convolution1d_1",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "name": "dropout_2",
          "trainable": true
        },
        "name": "dropout_2",
        "inbound_nodes": [
          [
            [
              "merge_1",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "tanh",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 2,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_2_tanh_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_2_tanh_s0",
        "inbound_nodes": [
          [
            [
              "merge_1",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "sigmoid",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 2,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_2_sigm_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_2_sigm_s0",
        "inbound_nodes": [
          [
            [
              "dropout_2",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "gated_activation_1_s0",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "mul"
        },
        "name": "gated_activation_1_s0",
        "inbound_nodes": [
          [
            [
              "dilated_conv_2_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_2_sigm_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_3",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_3",
        "inbound_nodes": [
          [
            [
              "gated_activation_1_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "merge_2",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "sum"
        },
        "name": "merge_2",
        "inbound_nodes": [
          [
            [
              "merge_1",
              0,
              0
            ],
            [
              "convolution1d_3",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "name": "dropout_3",
          "trainable": true
        },
        "name": "dropout_3",
        "inbound_nodes": [
          [
            [
              "merge_2",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "tanh",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 4,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_4_tanh_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_4_tanh_s0",
        "inbound_nodes": [
          [
            [
              "merge_2",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "sigmoid",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 4,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_4_sigm_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_4_sigm_s0",
        "inbound_nodes": [
          [
            [
              "dropout_3",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "gated_activation_2_s0",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "mul"
        },
        "name": "gated_activation_2_s0",
        "inbound_nodes": [
          [
            [
              "dilated_conv_4_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_4_sigm_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_5",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_5",
        "inbound_nodes": [
          [
            [
              "gated_activation_2_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "merge_3",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "sum"
        },
        "name": "merge_3",
        "inbound_nodes": [
          [
            [
              "merge_2",
              0,
              0
            ],
            [
              "convolution1d_5",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "name": "dropout_4",
          "trainable": true
        },
        "name": "dropout_4",
        "inbound_nodes": [
          [
            [
              "merge_3",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "tanh",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 8,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_8_tanh_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_8_tanh_s0",
        "inbound_nodes": [
          [
            [
              "merge_3",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "sigmoid",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 8,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_8_sigm_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_8_sigm_s0",
        "inbound_nodes": [
          [
            [
              "dropout_4",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "gated_activation_3_s0",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "mul"
        },
        "name": "gated_activation_3_s0",
        "inbound_nodes": [
          [
            [
              "dilated_conv_8_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_8_sigm_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_7",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_7",
        "inbound_nodes": [
          [
            [
              "gated_activation_3_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "merge_4",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "sum"
        },
        "name": "merge_4",
        "inbound_nodes": [
          [
            [
              "merge_3",
              0,
              0
            ],
            [
              "convolution1d_7",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "name": "dropout_5",
          "trainable": true
        },
        "name": "dropout_5",
        "inbound_nodes": [
          [
            [
              "merge_4",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "tanh",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 16,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_16_tanh_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_16_tanh_s0",
        "inbound_nodes": [
          [
            [
              "merge_4",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "sigmoid",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 16,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_16_sigm_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_16_sigm_s0",
        "inbound_nodes": [
          [
            [
              "dropout_5",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "gated_activation_4_s0",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "mul"
        },
        "name": "gated_activation_4_s0",
        "inbound_nodes": [
          [
            [
              "dilated_conv_16_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_16_sigm_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_9",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_9",
        "inbound_nodes": [
          [
            [
              "gated_activation_4_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "merge_5",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "sum"
        },
        "name": "merge_5",
        "inbound_nodes": [
          [
            [
              "merge_4",
              0,
              0
            ],
            [
              "convolution1d_9",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "name": "dropout_6",
          "trainable": true
        },
        "name": "dropout_6",
        "inbound_nodes": [
          [
            [
              "merge_5",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "tanh",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 32,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_32_tanh_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_32_tanh_s0",
        "inbound_nodes": [
          [
            [
              "merge_5",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "sigmoid",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 32,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_32_sigm_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_32_sigm_s0",
        "inbound_nodes": [
          [
            [
              "dropout_6",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "gated_activation_5_s0",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "mul"
        },
        "name": "gated_activation_5_s0",
        "inbound_nodes": [
          [
            [
              "dilated_conv_32_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_32_sigm_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_11",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_11",
        "inbound_nodes": [
          [
            [
              "gated_activation_5_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "merge_6",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "sum"
        },
        "name": "merge_6",
        "inbound_nodes": [
          [
            [
              "merge_5",
              0,
              0
            ],
            [
              "convolution1d_11",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "name": "dropout_7",
          "trainable": true
        },
        "name": "dropout_7",
        "inbound_nodes": [
          [
            [
              "merge_6",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "tanh",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 64,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_64_tanh_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_64_tanh_s0",
        "inbound_nodes": [
          [
            [
              "merge_6",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "sigmoid",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 64,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_64_sigm_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_64_sigm_s0",
        "inbound_nodes": [
          [
            [
              "dropout_7",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "gated_activation_6_s0",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "mul"
        },
        "name": "gated_activation_6_s0",
        "inbound_nodes": [
          [
            [
              "dilated_conv_64_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_64_sigm_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_13",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_13",
        "inbound_nodes": [
          [
            [
              "gated_activation_6_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "merge_7",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "sum"
        },
        "name": "merge_7",
        "inbound_nodes": [
          [
            [
              "merge_6",
              0,
              0
            ],
            [
              "convolution1d_13",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "name": "dropout_8",
          "trainable": true
        },
        "name": "dropout_8",
        "inbound_nodes": [
          [
            [
              "merge_7",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "tanh",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 128,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_128_tanh_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_128_tanh_s0",
        "inbound_nodes": [
          [
            [
              "merge_7",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "sigmoid",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 128,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_128_sigm_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_128_sigm_s0",
        "inbound_nodes": [
          [
            [
              "dropout_8",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "gated_activation_7_s0",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "mul"
        },
        "name": "gated_activation_7_s0",
        "inbound_nodes": [
          [
            [
              "dilated_conv_128_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_128_sigm_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_15",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_15",
        "inbound_nodes": [
          [
            [
              "gated_activation_7_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "merge_8",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "sum"
        },
        "name": "merge_8",
        "inbound_nodes": [
          [
            [
              "merge_7",
              0,
              0
            ],
            [
              "convolution1d_15",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "name": "dropout_9",
          "trainable": true
        },
        "name": "dropout_9",
        "inbound_nodes": [
          [
            [
              "merge_8",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "tanh",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 256,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_256_tanh_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_256_tanh_s0",
        "inbound_nodes": [
          [
            [
              "merge_8",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "init": "glorot_uniform",
          "activation": "sigmoid",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "atrous_rate": 256,
          "border_mode": "valid",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "dilated_conv_256_sigm_s0",
          "filter_length": 2,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "subsample_length": 1
        },
        "name": "dilated_conv_256_sigm_s0",
        "inbound_nodes": [
          [
            [
              "dropout_9",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "gated_activation_8_s0",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "mul"
        },
        "name": "gated_activation_8_s0",
        "inbound_nodes": [
          [
            [
              "dilated_conv_256_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_256_sigm_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_2",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_2",
        "inbound_nodes": [
          [
            [
              "gated_activation_0_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_4",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_4",
        "inbound_nodes": [
          [
            [
              "gated_activation_1_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_6",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_6",
        "inbound_nodes": [
          [
            [
              "gated_activation_2_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_8",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_8",
        "inbound_nodes": [
          [
            [
              "gated_activation_3_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_10",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_10",
        "inbound_nodes": [
          [
            [
              "gated_activation_4_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_12",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_12",
        "inbound_nodes": [
          [
            [
              "gated_activation_5_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_14",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_14",
        "inbound_nodes": [
          [
            [
              "gated_activation_6_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_16",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_16",
        "inbound_nodes": [
          [
            [
              "gated_activation_7_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 64,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": false,
          "b_constraint": null,
          "W_constraint": null,
          "name": "convolution1d_18",
          "filter_length": 1,
          "subsample_length": 1,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          }
        },
        "name": "convolution1d_18",
        "inbound_nodes": [
          [
            [
              "gated_activation_8_s0",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Merge",
        "config": {
          "output_mask_type": "raw",
          "arguments": {},
          "output_mask": null,
          "concat_axis": -1,
          "mode_type": "raw",
          "name": "merge_10",
          "dot_axes": -1,
          "output_shape_type": "raw",
          "output_shape": null,
          "mode": "sum"
        },
        "name": "merge_10",
        "inbound_nodes": [
          [
            [
              "convolution1d_2",
              0,
              0
            ],
            [
              "convolution1d_4",
              0,
              0
            ],
            [
              "convolution1d_6",
              0,
              0
            ],
            [
              "convolution1d_8",
              0,
              0
            ],
            [
              "convolution1d_10",
              0,
              0
            ],
            [
              "convolution1d_12",
              0,
              0
            ],
            [
              "convolution1d_14",
              0,
              0
            ],
            [
              "convolution1d_16",
              0,
              0
            ],
            [
              "convolution1d_18",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "PReLU",
        "config": {
          "init": "zero",
          "name": "prelu_1",
          "trainable": true
        },
        "name": "prelu_1",
        "inbound_nodes": [
          [
            [
              "merge_10",
              0,
              0
            ]
          ]
        ]
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "input_length": null,
          "b_regularizer": null,
          "activation": "linear",
          "init": "glorot_uniform",
          "trainable": true,
          "input_dim": null,
          "nb_filter": 4,
          "border_mode": "same",
          "activity_regularizer": null,
          "bias": true,
          "b_constraint": null,
          "W_constraint": null,
