{
  "class_name": "Model",
  "keras_version": "1.2.2",
  "config": {
    "output_layers": [
      [
        "fc1",
        0,
        0
      ]
    ],
    "name": "model_1",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "input_dtype": "float32",
          "batch_input_shape": [
            null,
            1000,
            4
          ],
          "name": "input_part",
          "sparse": false
        },
        "inbound_nodes": [],
        "name": "input_part"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": null,
          "name": "initial_causal_conv",
          "bias": true,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 1,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "input_part",
              0,
              0
            ]
          ]
        ],
        "name": "initial_causal_conv"
      },
      {
        "class_name": "Dropout",
        "config": {
          "trainable": true,
          "name": "dropout_1",
          "p": 0.2
        },
        "inbound_nodes": [
          [
            [
              "initial_causal_conv",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_1"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_1_tanh_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 1,
          "activation": "tanh"
        },
        "inbound_nodes": [
          [
            [
              "initial_causal_conv",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_1_tanh_s0"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_1_sigm_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 1,
          "activation": "sigmoid"
        },
        "inbound_nodes": [
          [
            [
              "dropout_1",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_1_sigm_s0"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "gated_activation_0_s0",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "mul"
        },
        "inbound_nodes": [
          [
            [
              "dilated_conv_1_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_1_sigm_s0",
              0,
              0
            ]
          ]
        ],
        "name": "gated_activation_0_s0"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_1",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_0_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_1"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_1",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "sum"
        },
        "inbound_nodes": [
          [
            [
              "initial_causal_conv",
              0,
              0
            ],
            [
              "convolution1d_1",
              0,
              0
            ]
          ]
        ],
        "name": "merge_1"
      },
      {
        "class_name": "Dropout",
        "config": {
          "trainable": true,
          "name": "dropout_2",
          "p": 0.2
        },
        "inbound_nodes": [
          [
            [
              "merge_1",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_2"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_2_tanh_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 2,
          "activation": "tanh"
        },
        "inbound_nodes": [
          [
            [
              "merge_1",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_2_tanh_s0"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_2_sigm_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 2,
          "activation": "sigmoid"
        },
        "inbound_nodes": [
          [
            [
              "dropout_2",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_2_sigm_s0"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "gated_activation_1_s0",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "mul"
        },
        "inbound_nodes": [
          [
            [
              "dilated_conv_2_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_2_sigm_s0",
              0,
              0
            ]
          ]
        ],
        "name": "gated_activation_1_s0"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_3",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_1_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_3"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_2",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "sum"
        },
        "inbound_nodes": [
          [
            [
              "merge_1",
              0,
              0
            ],
            [
              "convolution1d_3",
              0,
              0
            ]
          ]
        ],
        "name": "merge_2"
      },
      {
        "class_name": "Dropout",
        "config": {
          "trainable": true,
          "name": "dropout_3",
          "p": 0.2
        },
        "inbound_nodes": [
          [
            [
              "merge_2",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_3"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_4_tanh_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 4,
          "activation": "tanh"
        },
        "inbound_nodes": [
          [
            [
              "merge_2",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_4_tanh_s0"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_4_sigm_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 4,
          "activation": "sigmoid"
        },
        "inbound_nodes": [
          [
            [
              "dropout_3",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_4_sigm_s0"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "gated_activation_2_s0",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "mul"
        },
        "inbound_nodes": [
          [
            [
              "dilated_conv_4_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_4_sigm_s0",
              0,
              0
            ]
          ]
        ],
        "name": "gated_activation_2_s0"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_5",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_2_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_5"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_3",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "sum"
        },
        "inbound_nodes": [
          [
            [
              "merge_2",
              0,
              0
            ],
            [
              "convolution1d_5",
              0,
              0
            ]
          ]
        ],
        "name": "merge_3"
      },
      {
        "class_name": "Dropout",
        "config": {
          "trainable": true,
          "name": "dropout_4",
          "p": 0.2
        },
        "inbound_nodes": [
          [
            [
              "merge_3",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_4"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_8_tanh_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 8,
          "activation": "tanh"
        },
        "inbound_nodes": [
          [
            [
              "merge_3",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_8_tanh_s0"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_8_sigm_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 8,
          "activation": "sigmoid"
        },
        "inbound_nodes": [
          [
            [
              "dropout_4",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_8_sigm_s0"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "gated_activation_3_s0",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "mul"
        },
        "inbound_nodes": [
          [
            [
              "dilated_conv_8_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_8_sigm_s0",
              0,
              0
            ]
          ]
        ],
        "name": "gated_activation_3_s0"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_7",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_3_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_7"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_4",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "sum"
        },
        "inbound_nodes": [
          [
            [
              "merge_3",
              0,
              0
            ],
            [
              "convolution1d_7",
              0,
              0
            ]
          ]
        ],
        "name": "merge_4"
      },
      {
        "class_name": "Dropout",
        "config": {
          "trainable": true,
          "name": "dropout_5",
          "p": 0.2
        },
        "inbound_nodes": [
          [
            [
              "merge_4",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_5"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_16_tanh_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 16,
          "activation": "tanh"
        },
        "inbound_nodes": [
          [
            [
              "merge_4",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_16_tanh_s0"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_16_sigm_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 16,
          "activation": "sigmoid"
        },
        "inbound_nodes": [
          [
            [
              "dropout_5",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_16_sigm_s0"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "gated_activation_4_s0",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "mul"
        },
        "inbound_nodes": [
          [
            [
              "dilated_conv_16_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_16_sigm_s0",
              0,
              0
            ]
          ]
        ],
        "name": "gated_activation_4_s0"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_9",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_4_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_9"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_5",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "sum"
        },
        "inbound_nodes": [
          [
            [
              "merge_4",
              0,
              0
            ],
            [
              "convolution1d_9",
              0,
              0
            ]
          ]
        ],
        "name": "merge_5"
      },
      {
        "class_name": "Dropout",
        "config": {
          "trainable": true,
          "name": "dropout_6",
          "p": 0.2
        },
        "inbound_nodes": [
          [
            [
              "merge_5",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_6"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_32_tanh_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 32,
          "activation": "tanh"
        },
        "inbound_nodes": [
          [
            [
              "merge_5",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_32_tanh_s0"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_32_sigm_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 32,
          "activation": "sigmoid"
        },
        "inbound_nodes": [
          [
            [
              "dropout_6",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_32_sigm_s0"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "gated_activation_5_s0",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "mul"
        },
        "inbound_nodes": [
          [
            [
              "dilated_conv_32_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_32_sigm_s0",
              0,
              0
            ]
          ]
        ],
        "name": "gated_activation_5_s0"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_11",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_5_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_11"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_6",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "sum"
        },
        "inbound_nodes": [
          [
            [
              "merge_5",
              0,
              0
            ],
            [
              "convolution1d_11",
              0,
              0
            ]
          ]
        ],
        "name": "merge_6"
      },
      {
        "class_name": "Dropout",
        "config": {
          "trainable": true,
          "name": "dropout_7",
          "p": 0.2
        },
        "inbound_nodes": [
          [
            [
              "merge_6",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_7"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_64_tanh_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 64,
          "activation": "tanh"
        },
        "inbound_nodes": [
          [
            [
              "merge_6",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_64_tanh_s0"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_64_sigm_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 64,
          "activation": "sigmoid"
        },
        "inbound_nodes": [
          [
            [
              "dropout_7",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_64_sigm_s0"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "gated_activation_6_s0",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "mul"
        },
        "inbound_nodes": [
          [
            [
              "dilated_conv_64_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_64_sigm_s0",
              0,
              0
            ]
          ]
        ],
        "name": "gated_activation_6_s0"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_13",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_6_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_13"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_7",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "sum"
        },
        "inbound_nodes": [
          [
            [
              "merge_6",
              0,
              0
            ],
            [
              "convolution1d_13",
              0,
              0
            ]
          ]
        ],
        "name": "merge_7"
      },
      {
        "class_name": "Dropout",
        "config": {
          "trainable": true,
          "name": "dropout_8",
          "p": 0.2
        },
        "inbound_nodes": [
          [
            [
              "merge_7",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_8"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_128_tanh_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 128,
          "activation": "tanh"
        },
        "inbound_nodes": [
          [
            [
              "merge_7",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_128_tanh_s0"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_128_sigm_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 128,
          "activation": "sigmoid"
        },
        "inbound_nodes": [
          [
            [
              "dropout_8",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_128_sigm_s0"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "gated_activation_7_s0",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "mul"
        },
        "inbound_nodes": [
          [
            [
              "dilated_conv_128_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_128_sigm_s0",
              0,
              0
            ]
          ]
        ],
        "name": "gated_activation_7_s0"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_15",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_7_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_15"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_8",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "sum"
        },
        "inbound_nodes": [
          [
            [
              "merge_7",
              0,
              0
            ],
            [
              "convolution1d_15",
              0,
              0
            ]
          ]
        ],
        "name": "merge_8"
      },
      {
        "class_name": "Dropout",
        "config": {
          "trainable": true,
          "name": "dropout_9",
          "p": 0.2
        },
        "inbound_nodes": [
          [
            [
              "merge_8",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_9"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_256_tanh_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 256,
          "activation": "tanh"
        },
        "inbound_nodes": [
          [
            [
              "merge_8",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_256_tanh_s0"
      },
      {
        "class_name": "CausalAtrousConvolution1D",
        "config": {
          "filter_length": 2,
          "b_constraint": null,
          "b_regularizer": null,
          "border_mode": "valid",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "dilated_conv_256_sigm_s0",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "atrous_rate": 256,
          "activation": "sigmoid"
        },
        "inbound_nodes": [
          [
            [
              "dropout_9",
              0,
              0
            ]
          ]
        ],
        "name": "dilated_conv_256_sigm_s0"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "gated_activation_8_s0",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "mul"
        },
        "inbound_nodes": [
          [
            [
              "dilated_conv_256_tanh_s0",
              0,
              0
            ],
            [
              "dilated_conv_256_sigm_s0",
              0,
              0
            ]
          ]
        ],
        "name": "gated_activation_8_s0"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_2",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_0_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_2"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_4",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_1_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_4"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_6",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_2_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_6"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_8",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_3_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_8"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_10",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_4_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_10"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_12",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_5_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_12"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_14",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_6_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_14"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_16",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_7_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_16"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 64,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
            "l1": 0.0,
            "name": "L1L2Regularizer",
            "l2": 0.0
          },
          "name": "convolution1d_18",
          "bias": false,
          "input_length": null,
          "W_constraint": null,
          "b_constraint": null,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "gated_activation_8_s0",
              0,
              0
            ]
          ]
        ],
        "name": "convolution1d_18"
      },
      {
        "class_name": "Merge",
        "config": {
          "name": "merge_10",
          "output_shape_type": "raw",
          "dot_axes": -1,
          "output_mask": null,
          "mode_type": "raw",
          "arguments": {},
          "output_mask_type": "raw",
          "concat_axis": -1,
          "output_shape": null,
          "mode": "sum"
        },
        "inbound_nodes": [
          [
            [
              "convolution1d_2",
              0,
              0
            ],
            [
              "convolution1d_4",
              0,
              0
            ],
            [
              "convolution1d_6",
              0,
              0
            ],
            [
              "convolution1d_8",
              0,
              0
            ],
            [
              "convolution1d_10",
              0,
              0
            ],
            [
              "convolution1d_12",
              0,
              0
            ],
            [
              "convolution1d_14",
              0,
              0
            ],
            [
              "convolution1d_16",
              0,
              0
            ],
            [
              "convolution1d_18",
              0,
              0
            ]
          ]
        ],
        "name": "merge_10"
      },
      {
        "class_name": "Activation",
        "config": {
          "trainable": true,
          "name": "activation_1",
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "merge_10",
              0,
              0
            ]
          ]
        ],
        "name": "activation_1"
      },
      {
        "class_name": "Convolution1D",
        "config": {
          "filter_length": 1,
          "b_regularizer": null,
          "border_mode": "same",
          "nb_filter": 4,
          "subsample_length": 1,
          "input_dim": null,
          "init": "glorot_uniform",
          "activity_regularizer": null,
          "trainable": true,
          "W_regularizer": {
