Creating model from conv_net()
Building the model
Compiling model
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
convolution1d_1 (Convolution1D)  (None, 998, 64)       832         convolution1d_input_1[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 998, 64)       0           convolution1d_1[0][0]
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 998, 64)       256         activation_1[0][0]
____________________________________________________________________________________________________
convolution1d_2 (Convolution1D)  (None, 996, 64)       12352       batchnormalization_1[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 996, 64)       0           convolution1d_2[0][0]
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 996, 64)       256         activation_2[0][0]
____________________________________________________________________________________________________
maxpooling1d_1 (MaxPooling1D)    (None, 498, 64)       0           batchnormalization_2[0][0]
____________________________________________________________________________________________________
convolution1d_3 (Convolution1D)  (None, 496, 128)      24704       maxpooling1d_1[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 496, 128)      0           convolution1d_3[0][0]
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 496, 128)      512         activation_3[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 496, 128)      0           batchnormalization_3[0][0]
____________________________________________________________________________________________________
convolution1d_4 (Convolution1D)  (None, 494, 128)      49280       dropout_1[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 494, 128)      0           convolution1d_4[0][0]
____________________________________________________________________________________________________
batchnormalization_4 (BatchNorma (None, 494, 128)      512         activation_4[0][0]
____________________________________________________________________________________________________
maxpooling1d_2 (MaxPooling1D)    (None, 247, 128)      0           batchnormalization_4[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 247, 128)      0           maxpooling1d_2[0][0]
____________________________________________________________________________________________________
convolution1d_5 (Convolution1D)  (None, 243, 256)      164096      dropout_2[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 243, 256)      0           convolution1d_5[0][0]
____________________________________________________________________________________________________
batchnormalization_5 (BatchNorma (None, 243, 256)      1024        activation_5[0][0]
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 243, 256)      0           batchnormalization_5[0][0]
____________________________________________________________________________________________________
convolution1d_6 (Convolution1D)  (None, 239, 256)      327936      dropout_3[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 239, 256)      0           convolution1d_6[0][0]
____________________________________________________________________________________________________
maxpooling1d_3 (MaxPooling1D)    (None, 119, 256)      0           activation_6[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 30464)         0           maxpooling1d_3[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 1024)          31196160    flatten_1[0][0]
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 1024)          0           dense_1[0][0]
____________________________________________________________________________________________________
batchnormalization_6 (BatchNorma (None, 1024)          4096        activation_7[0][0]
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 1024)          0           batchnormalization_6[0][0]
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 919)           941975      dropout_4[0][0]
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 919)           0           dense_2[0][0]
====================================================================================================
Total params: 32,723,991
Trainable params: 32,720,663
Non-trainable params: 3,328
____________________________________________________________________________________________________
Saving models in json and yaml format to models/json/conv_net_21.json and  models/yaml/conv_net_21.yaml
Saving weights to models/weights/conv_net_21.hdf5 and epoch logs to models/csv/conv_net_21.csv
Saving models/json/conv_net_21.json to models/json/conv_net_21.json.old
Saving models/yaml/conv_net_21.yaml to models/yaml/conv_net_21.yaml.old
Retrieving train, validation, and test data

The date is 02/22/2017
The time is 12:58:06 AM

Loading weights from models/weights/conv_net_21.hdf5 if it exists
Saving models/csv/conv_net_21.csv to models/csv/conv_net_21.csv.old
Running at most 70 epochs
Train on 2200000 samples, validate on 8000 samples
Epoch 1/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.1296 - acc: 0.9784Epoch 00000: val_loss improved from inf to 0.11228, saving model to models/weights/conv_net_21.hdf5
2200000/2200000 [==============================] - 3637s - loss: 0.1296 - acc: 0.9784 - val_loss: 0.1123 - val_acc: 0.9805
Epoch 2/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.1262 - acc: 0.9784Epoch 00001: val_loss improved from 0.11228 to 0.11203, saving model to models/weights/conv_net_21.hdf5
2200000/2200000 [==============================] - 3637s - loss: 0.1262 - acc: 0.9784 - val_loss: 0.1120 - val_acc: 0.9805
Epoch 3/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.1252 - acc: 0.9784Epoch 00002: val_loss improved from 0.11203 to 0.11078, saving model to models/weights/conv_net_21.hdf5
2200000/2200000 [==============================] - 3637s - loss: 0.1252 - acc: 0.9784 - val_loss: 0.1108 - val_acc: 0.9805
Epoch 4/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.1246 - acc: 0.9784Epoch 00003: val_loss improved from 0.11078 to 0.11000, saving model to models/weights/conv_net_21.hdf5
2200000/2200000 [==============================] - 3637s - loss: 0.1246 - acc: 0.9784 - val_loss: 0.1100 - val_acc: 0.9805
Epoch 5/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.1241 - acc: 0.9784Epoch 00004: val_loss improved from 0.11000 to 0.10956, saving model to models/weights/conv_net_21.hdf5
2200000/2200000 [==============================] - 3637s - loss: 0.1241 - acc: 0.9784 - val_loss: 0.1096 - val_acc: 0.9805
Epoch 6/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.1238 - acc: 0.9784Epoch 00005: val_loss did not improve
2200000/2200000 [==============================] - 3635s - loss: 0.1238 - acc: 0.9784 - val_loss: 0.1096 - val_acc: 0.9805
Epoch 7/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.1236 - acc: 0.9784Epoch 00006: val_loss did not improve
2200000/2200000 [==============================] - 3635s - loss: 0.1236 - acc: 0.9784 - val_loss: 0.1098 - val_acc: 0.9805
