Building the model
Compiling model
____________________________________________________________________________________________________
Layer (type)			 Output Shape	       Param #	   Connected to
====================================================================================================
convolution1d_1 (Convolution1D)  (None, 998, 64)       832	   convolution1d_input_1[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)	 (None, 998, 64)       0	   convolution1d_1[0][0]
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 998, 64)       256	   activation_1[0][0]
____________________________________________________________________________________________________
convolution1d_2 (Convolution1D)  (None, 996, 64)       12352	   batchnormalization_1[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)	 (None, 996, 64)       0	   convolution1d_2[0][0]
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 996, 64)       256	   activation_2[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)		 (None, 996, 64)       0	   batchnormalization_2[0][0]
____________________________________________________________________________________________________
maxpooling1d_1 (MaxPooling1D)	 (None, 498, 64)       0	   dropout_1[0][0]
____________________________________________________________________________________________________
convolution1d_3 (Convolution1D)  (None, 496, 128)      24704	   maxpooling1d_1[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)	 (None, 496, 128)      0	   convolution1d_3[0][0]
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 496, 128)      512	   activation_3[0][0]
____________________________________________________________________________________________________
convolution1d_4 (Convolution1D)  (None, 494, 128)      49280	   batchnormalization_3[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)	 (None, 494, 128)      0	   convolution1d_4[0][0]
____________________________________________________________________________________________________
batchnormalization_4 (BatchNorma (None, 494, 128)      512	   activation_4[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)		 (None, 494, 128)      0	   batchnormalization_4[0][0]
____________________________________________________________________________________________________
maxpooling1d_2 (MaxPooling1D)	 (None, 247, 128)      0	   dropout_2[0][0]
____________________________________________________________________________________________________
convolution1d_5 (Convolution1D)  (None, 245, 256)      98560	   maxpooling1d_2[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)	 (None, 245, 256)      0	   convolution1d_5[0][0]
____________________________________________________________________________________________________
batchnormalization_5 (BatchNorma (None, 245, 256)      1024	   activation_5[0][0]
____________________________________________________________________________________________________
convolution1d_6 (Convolution1D)  (None, 243, 256)      196864	   batchnormalization_5[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)	 (None, 243, 256)      0	   convolution1d_6[0][0]
____________________________________________________________________________________________________
batchnormalization_6 (BatchNorma (None, 243, 256)      1024	   activation_6[0][0]
____________________________________________________________________________________________________
dropout_3 (Dropout)		 (None, 243, 256)      0	   batchnormalization_6[0][0]
____________________________________________________________________________________________________
maxpooling1d_3 (MaxPooling1D)	 (None, 121, 256)      0	   dropout_3[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)		 (None, 30976)	       0	   maxpooling1d_3[0][0]
____________________________________________________________________________________________________
dense_1 (Dense) 		 (None, 1024)	       31720448    flatten_1[0][0]
____________________________________________________________________________________________________
activation_7 (Activation)	 (None, 1024)	       0	   dense_1[0][0]
____________________________________________________________________________________________________
batchnormalization_7 (BatchNorma (None, 1024)	       4096	   activation_7[0][0]
____________________________________________________________________________________________________
dropout_4 (Dropout)		 (None, 1024)	       0	   batchnormalization_7[0][0]
____________________________________________________________________________________________________
dense_2 (Dense) 		 (None, 919)	       941975	   dropout_4[0][0]
____________________________________________________________________________________________________
activation_8 (Activation)	 (None, 919)	       0	   dense_2[0][0]
====================================================================================================
Total params: 33,052,695
Trainable params: 33,048,855
Non-trainable params: 3,840
____________________________________________________________________________________________________
Saving models in json and yaml format to models/json/conv_net_18.json and  models/yaml/conv_net_18.yaml
Saving weights to models/weights/conv_net_18.hdf5 and epoch logs to models/csv/conv_net_18.csv
Saving models/json/conv_net_18.json to models/json/conv_net_18.json.old
Saving models/yaml/conv_net_18.yaml to models/yaml/conv_net_18.yaml.old
Retrieving train, validation, and test data

The date is 02/20/2017
The time is 03:25:47 AM

Loading weights from models/weights/conv_net_18.hdf5 if it exists
Saving models/csv/conv_net_18.csv to models/csv/conv_net_18.csv.old
Running at most 70 epochs
Train on 2200000 samples, validate on 8000 samples
Epoch 1/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.08422--acc::0.9763Epoch 00000: val_loss improved from inf to 0.06332, saving model to models/weights/conv_net_18.hdf5
2200000/2200000 [==============================] - 3904s - loss: 0.0842 - acc: 0.9763 - val_loss: 0.0633 - val_acc: 0.9820
Epoch 2/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06966--acc::0.9797Epoch 00001: val_loss improved from 0.06332 to 0.05919, saving model to models/weights/conv_net_18.hdf5
2200000/2200000 [==============================] - 3908s - loss: 0.0696 - acc: 0.9797 - val_loss: 0.0592 - val_acc: 0.9825
Epoch 3/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06711--acc::0.9800Epoch 00002: val_loss did not improve
2200000/2200000 [==============================] - 3907s - loss: 0.0671 - acc: 0.9800 - val_loss: 0.0686 - val_acc: 0.9818
Epoch 4/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06588--acc::0.9802Epoch 00003: val_loss did not improve
2200000/2200000 [==============================] - 3906s - loss: 0.0658 - acc: 0.9802 - val_loss: 0.0592 - val_acc: 0.9823
Epoch 5/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06488--acc::0.9803Epoch 00004: val_loss improved from 0.05919 to 0.05697, saving model to models/weights/conv_net_18.hdf5
2200000/2200000 [==============================] - 3903s - loss: 0.0648 - acc: 0.9803 - val_loss: 0.0570 - val_acc: 0.9827
Epoch 6/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06399--acc::0.9805Epoch 00005: val_loss did not improve
2200000/2200000 [==============================] - 3903s - loss: 0.0639 - acc: 0.9805 - val_loss: 0.0581 - val_acc: 0.9827
Epoch 7/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06377--acc::0.9805Epoch 00006: val_loss improved from 0.05697 to 0.05592, saving model to models/weights/conv_net_18.hdf5
2200000/2200000 [==============================] - 3903s - loss: 0.0637 - acc: 0.9805 - val_loss: 0.0559 - val_acc: 0.9828
Epoch 8/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06299--acc::0.9806Epoch 00007: val_loss did not improve
2200000/2200000 [==============================] - 3902s - loss: 0.0629 - acc: 0.9806 - val_loss: 0.0575 - val_acc: 0.9827
Epoch 9/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06277--acc::0.9807Epoch 00008: val_loss improved from 0.05592 to 0.05571, saving model to models/weights/conv_net_18.hdf5
2200000/2200000 [==============================] - 3904s - loss: 0.0627 - acc: 0.9807 - val_loss: 0.0557 - val_acc: 0.9826
Epoch 10/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06211--acc::0.9808Epoch 00009: val_loss improved from 0.05571 to 0.05520, saving model to models/weights/conv_net_18.hdf5
2200000/2200000 [==============================] - 3903s - loss: 0.0621 - acc: 0.9808 - val_loss: 0.0552 - val_acc: 0.9829
Epoch 11/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06188--acc::0.9808Epoch 00010: val_loss did not improve
2200000/2200000 [==============================] - 3903s - loss: 0.0618 - acc: 0.9808 - val_loss: 0.0554 - val_acc: 0.9827
Epoch 12/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06144--acc::0.9809Epoch 00011: val_loss did not improve
2200000/2200000 [==============================] - 3903s - loss: 0.0614 - acc: 0.9809 - val_loss: 0.0556 - val_acc: 0.9827
Epoch 13/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06100--acc::0.9810Epoch 00012: val_loss did not improve
2200000/2200000 [==============================] - 3902s - loss: 0.0610 - acc: 0.9810 - val_loss: 0.0560 - val_acc: 0.9826
Epoch 14/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06088--acc::0.9810Epoch 00013: val_loss did not improve
2200000/2200000 [==============================] - 3902s - loss: 0.0608 - acc: 0.9810 - val_loss: 0.0562 - val_acc: 0.9824
Epoch 15/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06055--acc::0.9811Epoch 00014: val_loss improved from 0.05520 to 0.05510, saving model to models/weights/conv_net_18.hdf5
2200000/2200000 [==============================] - 3903s - loss: 0.0605 - acc: 0.9811 - val_loss: 0.0551 - val_acc: 0.9827
Epoch 16/70
2199600/2200000 [============================>.] - ETA: 0ss--loss::0.06022--acc::0.9812Epoch 00015: val_loss improved from 0.05510 to 0.05500, saving model to models/weights/conv_net_18.hdf5
2200000/2200000 [==============================] - 3903s - loss: 0.0602 - acc: 0.9812 - val_loss: 0.0550 - val_acc: 0.9828
455008/455024 [============================>.] - ETA: 0s
[0.060906380515499368, 0.98125103595048135]


