Creating model from conv_net()
Building the model
Compiling model
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
convolution1d_1 (Convolution1D)  (None, 998, 64)       832         convolution1d_input_1[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 998, 64)       0           convolution1d_1[0][0]
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 998, 64)       256         activation_1[0][0]
____________________________________________________________________________________________________
convolution1d_2 (Convolution1D)  (None, 996, 64)       12352       batchnormalization_1[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 996, 64)       0           convolution1d_2[0][0]
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 996, 64)       256         activation_2[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 996, 64)       0           batchnormalization_2[0][0]
____________________________________________________________________________________________________
maxpooling1d_1 (MaxPooling1D)    (None, 498, 64)       0           dropout_1[0][0]
____________________________________________________________________________________________________
convolution1d_3 (Convolution1D)  (None, 496, 128)      24704       maxpooling1d_1[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 496, 128)      0           convolution1d_3[0][0]
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 496, 128)      512         activation_3[0][0]
____________________________________________________________________________________________________
convolution1d_4 (Convolution1D)  (None, 494, 128)      49280       batchnormalization_3[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 494, 128)      0           convolution1d_4[0][0]
____________________________________________________________________________________________________
batchnormalization_4 (BatchNorma (None, 494, 128)      512         activation_4[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 494, 128)      0           batchnormalization_4[0][0]
____________________________________________________________________________________________________
maxpooling1d_2 (MaxPooling1D)    (None, 247, 128)      0           dropout_2[0][0]
____________________________________________________________________________________________________
convolution1d_5 (Convolution1D)  (None, 243, 256)      164096      maxpooling1d_2[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 243, 256)      0           convolution1d_5[0][0]
____________________________________________________________________________________________________
batchnormalization_5 (BatchNorma (None, 243, 256)      1024        activation_5[0][0]
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 243, 256)      0           batchnormalization_5[0][0]
____________________________________________________________________________________________________
convolution1d_6 (Convolution1D)  (None, 239, 256)      327936      dropout_3[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 239, 256)      0           convolution1d_6[0][0]
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 239, 256)      0           activation_6[0][0]
____________________________________________________________________________________________________
maxpooling1d_3 (MaxPooling1D)    (None, 119, 256)      0           dropout_4[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 30464)         0           maxpooling1d_3[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 1024)          31196160    flatten_1[0][0]
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 1024)          0           dense_1[0][0]
____________________________________________________________________________________________________
batchnormalization_6 (BatchNorma (None, 1024)          4096        activation_7[0][0]
____________________________________________________________________________________________________
dropout_5 (Dropout)              (None, 1024)          0           batchnormalization_6[0][0]
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 919)           941975      dropout_5[0][0]
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 919)           0           dense_2[0][0]
====================================================================================================
Total params: 32,723,991
Trainable params: 32,720,663
Non-trainable params: 3,328
____________________________________________________________________________________________________
Saving models in json and yaml format to models/json/conv_net_14.json and  models/yaml/conv_net_14.yaml
Saving weights to models/weights/conv_net_14.hdf5 and epoch logs to models/csv/conv_net_14.csv
Saving models/json/conv_net_14.json to models/json/conv_net_14.json.old
Saving models/yaml/conv_net_14.yaml to models/yaml/conv_net_14.yaml.old
Retrieving train, validation, and test data

The date is 02/14/2017
The time is 03:46:59 AM

Loading weights from models/weights/conv_net_14.hdf5 if it exists
Saving models/weights/conv_net_14.hdf5 to models/weights/conv_net_14.hdf5.old
Saving models/csv/conv_net_14.csv to models/csv/conv_net_14.csv.old
Running at most 70 epochs
Train on 2200000 samples, validate on 8000 samples
Epoch 1/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0722 - acc: 0.9794Epoch 00000: val_loss improved from inf to 0.06085, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3908s - loss: 0.0722 - acc: 0.9794 - val_loss: 0.0609 - val_acc: 0.9824
Epoch 2/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0678 - acc: 0.9799Epoch 00001: val_loss did not improve
2200000/2200000 [==============================] - 3907s - loss: 0.0678 - acc: 0.9799 - val_loss: 0.0611 - val_acc: 0.9825
Epoch 3/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0665 - acc: 0.9801Epoch 00002: val_loss improved from 0.06085 to 0.05830, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3908s - loss: 0.0665 - acc: 0.9801 - val_loss: 0.0583 - val_acc: 0.9826
Epoch 4/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0656 - acc: 0.9802Epoch 00003: val_loss improved from 0.05830 to 0.05706, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3908s - loss: 0.0656 - acc: 0.9802 - val_loss: 0.0571 - val_acc: 0.9827
Epoch 5/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0649 - acc: 0.9803Epoch 00004: val_loss improved from 0.05706 to 0.05687, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3907s - loss: 0.0649 - acc: 0.9803 - val_loss: 0.0569 - val_acc: 0.9827
Epoch 6/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0644 - acc: 0.9804Epoch 00005: val_loss improved from 0.05687 to 0.05629, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3907s - loss: 0.0644 - acc: 0.9804 - val_loss: 0.0563 - val_acc: 0.9828
Epoch 7/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0640 - acc: 0.9804Epoch 00006: val_loss improved from 0.05629 to 0.05620, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3907s - loss: 0.0640 - acc: 0.9804 - val_loss: 0.0562 - val_acc: 0.9828
Epoch 8/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0636 - acc: 0.9805Epoch 00007: val_loss improved from 0.05620 to 0.05579, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3908s - loss: 0.0636 - acc: 0.9805 - val_loss: 0.0558 - val_acc: 0.9829
Epoch 9/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0633 - acc: 0.9805Epoch 00008: val_loss did not improve
2200000/2200000 [==============================] - 3906s - loss: 0.0633 - acc: 0.9805 - val_loss: 0.0561 - val_acc: 0.9830
Epoch 10/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0631 - acc: 0.9806Epoch 00009: val_loss did not improve
2200000/2200000 [==============================] - 3906s - loss: 0.0631 - acc: 0.9806 - val_loss: 0.0560 - val_acc: 0.9830
Epoch 11/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0628 - acc: 0.9806Epoch 00010: val_loss improved from 0.05579 to 0.05577, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3907s - loss: 0.0628 - acc: 0.9806 - val_loss: 0.0558 - val_acc: 0.9830
Epoch 12/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0626 - acc: 0.9807Epoch 00011: val_loss improved from 0.05577 to 0.05572, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3906s - loss: 0.0626 - acc: 0.9807 - val_loss: 0.0557 - val_acc: 0.9830
Epoch 13/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0624 - acc: 0.9807Epoch 00012: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0624 - acc: 0.9807 - val_loss: 0.0567 - val_acc: 0.9829
Epoch 14/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0623 - acc: 0.9807Epoch 00013: val_loss improved from 0.05572 to 0.05511, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3906s - loss: 0.0623 - acc: 0.9807 - val_loss: 0.0551 - val_acc: 0.9831
Epoch 15/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0621 - acc: 0.9808Epoch 00014: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0621 - acc: 0.9808 - val_loss: 0.0558 - val_acc: 0.9830
Epoch 16/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0620 - acc: 0.9808Epoch 00015: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0620 - acc: 0.9808 - val_loss: 0.0552 - val_acc: 0.9831
Epoch 17/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0618 - acc: 0.9808Epoch 00016: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0618 - acc: 0.9808 - val_loss: 0.0564 - val_acc: 0.9829
Epoch 18/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0616 - acc: 0.9808Epoch 00017: val_loss improved from 0.05511 to 0.05474, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3906s - loss: 0.0616 - acc: 0.9808 - val_loss: 0.0547 - val_acc: 0.9830
Epoch 19/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0615 - acc: 0.9809Epoch 00018: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0615 - acc: 0.9809 - val_loss: 0.0549 - val_acc: 0.9830
Epoch 20/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0614 - acc: 0.9809Epoch 00019: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0614 - acc: 0.9809 - val_loss: 0.0554 - val_acc: 0.9830
Epoch 21/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0613 - acc: 0.9809Epoch 00020: val_loss did not improve
2200000/2200000 [==============================] - 3906s - loss: 0.0613 - acc: 0.9809 - val_loss: 0.0553 - val_acc: 0.9829
Epoch 22/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0612 - acc: 0.9809Epoch 00021: val_loss did not improve
2200000/2200000 [==============================] - 3906s - loss: 0.0612 - acc: 0.9809 - val_loss: 0.0549 - val_acc: 0.9829
Epoch 23/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0611 - acc: 0.9810Epoch 00022: val_loss improved from 0.05474 to 0.05464, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3906s - loss: 0.0611 - acc: 0.9810 - val_loss: 0.0546 - val_acc: 0.9831
Epoch 24/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0610 - acc: 0.9810Epoch 00023: val_loss did not improve
2200000/2200000 [==============================] - 3906s - loss: 0.0610 - acc: 0.9810 - val_loss: 0.0547 - val_acc: 0.9830
Epoch 25/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0610 - acc: 0.9810Epoch 00024: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0610 - acc: 0.9810 - val_loss: 0.0548 - val_acc: 0.9831
Epoch 26/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0609 - acc: 0.9810Epoch 00025: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0609 - acc: 0.9810 - val_loss: 0.0552 - val_acc: 0.9829
Epoch 27/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0608 - acc: 0.9810Epoch 00026: val_loss did not improve
2200000/2200000 [==============================] - 3904s - loss: 0.0608 - acc: 0.9810 - val_loss: 0.0547 - val_acc: 0.9830
Epoch 28/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0607 - acc: 0.9810Epoch 00027: val_loss improved from 0.05464 to 0.05442, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3906s - loss: 0.0607 - acc: 0.9810 - val_loss: 0.0544 - val_acc: 0.9831
Epoch 29/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0607 - acc: 0.9810Epoch 00028: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0607 - acc: 0.9810 - val_loss: 0.0553 - val_acc: 0.9830
Epoch 30/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0606 - acc: 0.9811Epoch 00029: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0606 - acc: 0.9811 - val_loss: 0.0550 - val_acc: 0.9830
Epoch 31/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0605 - acc: 0.9811Epoch 00030: val_loss improved from 0.05442 to 0.05421, saving model to models/weights/conv_net_14.hdf5
2200000/2200000 [==============================] - 3906s - loss: 0.0605 - acc: 0.9811 - val_loss: 0.0542 - val_acc: 0.9831
Epoch 32/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0605 - acc: 0.9811Epoch 00031: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0605 - acc: 0.9811 - val_loss: 0.0548 - val_acc: 0.9831
Epoch 33/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0604 - acc: 0.9811Epoch 00032: val_loss did not improve
2200000/2200000 [==============================] - 3905s - loss: 0.0604 - acc: 0.9811 - val_loss: 0.0544 - val_acc: 0.9830
Epoch 34/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0604 - acc: 0.9811Epoch 00033: val_loss did not improve
2200000/2200000 [==============================] - 3906s - loss: 0.0604 - acc: 0.9811 - val_loss: 0.0545 - val_acc: 0.9830
455008/455024 [============================>.] - ETA: 0s
[0.059873176577892241, 0.98148981612494668]
