
Creating model from ResNet()
Building the model
Compiling model
____________________________________________________________________________________________________
Layer (type)			 Output Shape	       Param #	   Connected to
====================================================================================================
input_1 (InputLayer)		 (None, 1000, 4)       0
____________________________________________________________________________________________________
zeropadding1d_1 (ZeroPadding1D)  (None, 1006, 4)       0	   input_1[0][0]
____________________________________________________________________________________________________
conv1 (Convolution1D)		 (None, 500, 64)       1856	   zeropadding1d_1[0][0]
____________________________________________________________________________________________________
bn_conv1 (BatchNormalization)	 (None, 500, 64)       256	   conv1[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)	 (None, 500, 64)       0	   bn_conv1[0][0]
____________________________________________________________________________________________________
maxpooling1d_1 (MaxPooling1D)	 (None, 249, 64)       0	   activation_1[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)		 (None, 249, 64)       0	   maxpooling1d_1[0][0]
____________________________________________________________________________________________________
res2a_branch2a (Convolution1D)	 (None, 249, 64)       4160	   dropout_1[0][0]
____________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizatio (None, 249, 64)       256	   res2a_branch2a[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)	 (None, 249, 64)       0	   bn2a_branch2a[0][0]
____________________________________________________________________________________________________
res2a_branch2b (Convolution1D)	 (None, 249, 64)       12352	   activation_2[0][0]
____________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizatio (None, 249, 64)       256	   res2a_branch2b[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)	 (None, 249, 64)       0	   bn2a_branch2b[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)		 (None, 249, 64)       0	   activation_3[0][0]
____________________________________________________________________________________________________
res2a_branch2c (Convolution1D)	 (None, 249, 256)      16640	   dropout_2[0][0]
____________________________________________________________________________________________________
res2a_branch1 (Convolution1D)	 (None, 249, 256)      16640	   dropout_1[0][0]
____________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizatio (None, 249, 256)      1024	   res2a_branch2c[0][0]
____________________________________________________________________________________________________
bn2a_branch1 (BatchNormalization (None, 249, 256)      1024	   res2a_branch1[0][0]
____________________________________________________________________________________________________
merge_1 (Merge) 		 (None, 249, 256)      0	   bn2a_branch2c[0][0]
								   bn2a_branch1[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)	 (None, 249, 256)      0	   merge_1[0][0]
____________________________________________________________________________________________________
res2b_branch2a (Convolution1D)	 (None, 249, 64)       16448	   activation_4[0][0]
____________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizatio (None, 249, 64)       256	   res2b_branch2a[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)	 (None, 249, 64)       0	   bn2b_branch2a[0][0]
____________________________________________________________________________________________________
res2b_branch2b (Convolution1D)	 (None, 249, 64)       12352	   activation_5[0][0]
____________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizatio (None, 249, 64)       256	   res2b_branch2b[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)	 (None, 249, 64)       0	   bn2b_branch2b[0][0]
____________________________________________________________________________________________________
res2b_branch2c (Convolution1D)	 (None, 249, 256)      16640	   activation_6[0][0]
____________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizatio (None, 249, 256)      1024	   res2b_branch2c[0][0]
____________________________________________________________________________________________________
merge_2 (Merge) 		 (None, 249, 256)      0	   bn2b_branch2c[0][0]
								   activation_4[0][0]
____________________________________________________________________________________________________
activation_7 (Activation)	 (None, 249, 256)      0	   merge_2[0][0]
____________________________________________________________________________________________________
res2c_branch2a (Convolution1D)	 (None, 249, 64)       16448	   activation_7[0][0]
____________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizatio (None, 249, 64)       256	   res2c_branch2a[0][0]
____________________________________________________________________________________________________
activation_8 (Activation)	 (None, 249, 64)       0	   bn2c_branch2a[0][0]
____________________________________________________________________________________________________
res2c_branch2b (Convolution1D)	 (None, 249, 64)       12352	   activation_8[0][0]
____________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizatio (None, 249, 64)       256	   res2c_branch2b[0][0]
____________________________________________________________________________________________________
activation_9 (Activation)	 (None, 249, 64)       0	   bn2c_branch2b[0][0]
____________________________________________________________________________________________________
res2c_branch2c (Convolution1D)	 (None, 249, 256)      16640	   activation_9[0][0]
____________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizatio (None, 249, 256)      1024	   res2c_branch2c[0][0]
____________________________________________________________________________________________________
merge_3 (Merge) 		 (None, 249, 256)      0	   bn2c_branch2c[0][0]
								   activation_7[0][0]
____________________________________________________________________________________________________
activation_10 (Activation)	 (None, 249, 256)      0	   merge_3[0][0]
____________________________________________________________________________________________________
res3a_branch2a (Convolution1D)	 (None, 125, 128)      32896	   activation_10[0][0]
____________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizatio (None, 125, 128)      512	   res3a_branch2a[0][0]
____________________________________________________________________________________________________
activation_11 (Activation)	 (None, 125, 128)      0	   bn3a_branch2a[0][0]
____________________________________________________________________________________________________
res3a_branch2b (Convolution1D)	 (None, 125, 128)      49280	   activation_11[0][0]
____________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizatio (None, 125, 128)      512	   res3a_branch2b[0][0]
____________________________________________________________________________________________________
activation_12 (Activation)	 (None, 125, 128)      0	   bn3a_branch2b[0][0]
____________________________________________________________________________________________________
dropout_3 (Dropout)		 (None, 125, 128)      0	   activation_12[0][0]
____________________________________________________________________________________________________
res3a_branch2c (Convolution1D)	 (None, 125, 512)      66048	   dropout_3[0][0]
____________________________________________________________________________________________________
res3a_branch1 (Convolution1D)	 (None, 125, 512)      131584	   activation_10[0][0]
____________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizatio (None, 125, 512)      2048	   res3a_branch2c[0][0]
____________________________________________________________________________________________________
bn3a_branch1 (BatchNormalization (None, 125, 512)      2048	   res3a_branch1[0][0]
____________________________________________________________________________________________________
merge_4 (Merge) 		 (None, 125, 512)      0	   bn3a_branch2c[0][0]
								   bn3a_branch1[0][0]
____________________________________________________________________________________________________
activation_13 (Activation)	 (None, 125, 512)      0	   merge_4[0][0]
____________________________________________________________________________________________________
res3b_branch2a (Convolution1D)	 (None, 125, 128)      65664	   activation_13[0][0]
____________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizatio (None, 125, 128)      512	   res3b_branch2a[0][0]
____________________________________________________________________________________________________
activation_14 (Activation)	 (None, 125, 128)      0	   bn3b_branch2a[0][0]
____________________________________________________________________________________________________
res3b_branch2b (Convolution1D)	 (None, 125, 128)      49280	   activation_14[0][0]
____________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizatio (None, 125, 128)      512	   res3b_branch2b[0][0]
____________________________________________________________________________________________________
activation_15 (Activation)	 (None, 125, 128)      0	   bn3b_branch2b[0][0]
____________________________________________________________________________________________________
res3b_branch2c (Convolution1D)	 (None, 125, 512)      66048	   activation_15[0][0]
____________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizatio (None, 125, 512)      2048	   res3b_branch2c[0][0]
____________________________________________________________________________________________________
merge_5 (Merge) 		 (None, 125, 512)      0	   bn3b_branch2c[0][0]
								   activation_13[0][0]
____________________________________________________________________________________________________
activation_16 (Activation)	 (None, 125, 512)      0	   merge_5[0][0]
____________________________________________________________________________________________________
res3c_branch2a (Convolution1D)	 (None, 125, 128)      65664	   activation_16[0][0]
____________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizatio (None, 125, 128)      512	   res3c_branch2a[0][0]
____________________________________________________________________________________________________
activation_17 (Activation)	 (None, 125, 128)      0	   bn3c_branch2a[0][0]
____________________________________________________________________________________________________
res3c_branch2b (Convolution1D)	 (None, 125, 128)      49280	   activation_17[0][0]
____________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizatio (None, 125, 128)      512	   res3c_branch2b[0][0]
____________________________________________________________________________________________________
activation_18 (Activation)	 (None, 125, 128)      0	   bn3c_branch2b[0][0]
____________________________________________________________________________________________________
res3c_branch2c (Convolution1D)	 (None, 125, 512)      66048	   activation_18[0][0]
____________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizatio (None, 125, 512)      2048	   res3c_branch2c[0][0]
____________________________________________________________________________________________________
merge_6 (Merge) 		 (None, 125, 512)      0	   bn3c_branch2c[0][0]
								   activation_16[0][0]
____________________________________________________________________________________________________
activation_19 (Activation)	 (None, 125, 512)      0	   merge_6[0][0]
____________________________________________________________________________________________________
res3d_branch2a (Convolution1D)	 (None, 125, 128)      65664	   activation_19[0][0]
____________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizatio (None, 125, 128)      512	   res3d_branch2a[0][0]
____________________________________________________________________________________________________
activation_20 (Activation)	 (None, 125, 128)      0	   bn3d_branch2a[0][0]
____________________________________________________________________________________________________
res3d_branch2b (Convolution1D)	 (None, 125, 128)      49280	   activation_20[0][0]
____________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizatio (None, 125, 128)      512	   res3d_branch2b[0][0]
____________________________________________________________________________________________________
activation_21 (Activation)	 (None, 125, 128)      0	   bn3d_branch2b[0][0]
____________________________________________________________________________________________________
res3d_branch2c (Convolution1D)	 (None, 125, 512)      66048	   activation_21[0][0]
____________________________________________________________________________________________________
bn3d_branch2c (BatchNormalizatio (None, 125, 512)      2048	   res3d_branch2c[0][0]
____________________________________________________________________________________________________
merge_7 (Merge) 		 (None, 125, 512)      0	   bn3d_branch2c[0][0]
								   activation_19[0][0]
____________________________________________________________________________________________________
activation_22 (Activation)	 (None, 125, 512)      0	   merge_7[0][0]
____________________________________________________________________________________________________
res4a_branch2a (Convolution1D)	 (None, 63, 256)       131328	   activation_22[0][0]
____________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizatio (None, 63, 256)       1024	   res4a_branch2a[0][0]
____________________________________________________________________________________________________
activation_23 (Activation)	 (None, 63, 256)       0	   bn4a_branch2a[0][0]
____________________________________________________________________________________________________
res4a_branch2b (Convolution1D)	 (None, 63, 256)       196864	   activation_23[0][0]
____________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizatio (None, 63, 256)       1024	   res4a_branch2b[0][0]
____________________________________________________________________________________________________
activation_24 (Activation)	 (None, 63, 256)       0	   bn4a_branch2b[0][0]
____________________________________________________________________________________________________
dropout_4 (Dropout)		 (None, 63, 256)       0	   activation_24[0][0]
____________________________________________________________________________________________________
res4a_branch2c (Convolution1D)	 (None, 63, 1024)      263168	   dropout_4[0][0]
____________________________________________________________________________________________________
res4a_branch1 (Convolution1D)	 (None, 63, 1024)      525312	   activation_22[0][0]
____________________________________________________________________________________________________
bn4a_branch2c (BatchNormalizatio (None, 63, 1024)      4096	   res4a_branch2c[0][0]
____________________________________________________________________________________________________
bn4a_branch1 (BatchNormalization (None, 63, 1024)      4096	   res4a_branch1[0][0]
____________________________________________________________________________________________________
merge_8 (Merge) 		 (None, 63, 1024)      0	   bn4a_branch2c[0][0]
								   bn4a_branch1[0][0]
____________________________________________________________________________________________________
activation_25 (Activation)	 (None, 63, 1024)      0	   merge_8[0][0]
____________________________________________________________________________________________________
res4b_branch2a (Convolution1D)	 (None, 63, 256)       262400	   activation_25[0][0]
____________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizatio (None, 63, 256)       1024	   res4b_branch2a[0][0]
____________________________________________________________________________________________________
activation_26 (Activation)	 (None, 63, 256)       0	   bn4b_branch2a[0][0]
____________________________________________________________________________________________________
res4b_branch2b (Convolution1D)	 (None, 63, 256)       196864	   activation_26[0][0]
____________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizatio (None, 63, 256)       1024	   res4b_branch2b[0][0]
____________________________________________________________________________________________________
activation_27 (Activation)	 (None, 63, 256)       0	   bn4b_branch2b[0][0]
____________________________________________________________________________________________________
res4b_branch2c (Convolution1D)	 (None, 63, 1024)      263168	   activation_27[0][0]
____________________________________________________________________________________________________
bn4b_branch2c (BatchNormalizatio (None, 63, 1024)      4096	   res4b_branch2c[0][0]
____________________________________________________________________________________________________
merge_9 (Merge) 		 (None, 63, 1024)      0	   bn4b_branch2c[0][0]
								   activation_25[0][0]
____________________________________________________________________________________________________
activation_28 (Activation)	 (None, 63, 1024)      0	   merge_9[0][0]
____________________________________________________________________________________________________
res4c_branch2a (Convolution1D)	 (None, 63, 256)       262400	   activation_28[0][0]
____________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizatio (None, 63, 256)       1024	   res4c_branch2a[0][0]
____________________________________________________________________________________________________
activation_29 (Activation)	 (None, 63, 256)       0	   bn4c_branch2a[0][0]
____________________________________________________________________________________________________
res4c_branch2b (Convolution1D)	 (None, 63, 256)       196864	   activation_29[0][0]
____________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizatio (None, 63, 256)       1024	   res4c_branch2b[0][0]
____________________________________________________________________________________________________
activation_30 (Activation)	 (None, 63, 256)       0	   bn4c_branch2b[0][0]
____________________________________________________________________________________________________
res4c_branch2c (Convolution1D)	 (None, 63, 1024)      263168	   activation_30[0][0]
____________________________________________________________________________________________________
bn4c_branch2c (BatchNormalizatio (None, 63, 1024)      4096	   res4c_branch2c[0][0]
____________________________________________________________________________________________________
merge_10 (Merge)		 (None, 63, 1024)      0	   bn4c_branch2c[0][0]
								   activation_28[0][0]
____________________________________________________________________________________________________
activation_31 (Activation)	 (None, 63, 1024)      0	   merge_10[0][0]
____________________________________________________________________________________________________
res4d_branch2a (Convolution1D)	 (None, 63, 256)       262400	   activation_31[0][0]
____________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizatio (None, 63, 256)       1024	   res4d_branch2a[0][0]
____________________________________________________________________________________________________
activation_32 (Activation)	 (None, 63, 256)       0	   bn4d_branch2a[0][0]
____________________________________________________________________________________________________
res4d_branch2b (Convolution1D)	 (None, 63, 256)       196864	   activation_32[0][0]
____________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizatio (None, 63, 256)       1024	   res4d_branch2b[0][0]
____________________________________________________________________________________________________
activation_33 (Activation)	 (None, 63, 256)       0	   bn4d_branch2b[0][0]
____________________________________________________________________________________________________
res4d_branch2c (Convolution1D)	 (None, 63, 1024)      263168	   activation_33[0][0]
____________________________________________________________________________________________________
bn4d_branch2c (BatchNormalizatio (None, 63, 1024)      4096	   res4d_branch2c[0][0]
____________________________________________________________________________________________________
merge_11 (Merge)		 (None, 63, 1024)      0	   bn4d_branch2c[0][0]
								   activation_31[0][0]
____________________________________________________________________________________________________
activation_34 (Activation)	 (None, 63, 1024)      0	   merge_11[0][0]
____________________________________________________________________________________________________
res4e_branch2a (Convolution1D)	 (None, 63, 256)       262400	   activation_34[0][0]
____________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizatio (None, 63, 256)       1024	   res4e_branch2a[0][0]
____________________________________________________________________________________________________
activation_35 (Activation)	 (None, 63, 256)       0	   bn4e_branch2a[0][0]
____________________________________________________________________________________________________
res4e_branch2b (Convolution1D)	 (None, 63, 256)       196864	   activation_35[0][0]
____________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizatio (None, 63, 256)       1024	   res4e_branch2b[0][0]
____________________________________________________________________________________________________
activation_36 (Activation)	 (None, 63, 256)       0	   bn4e_branch2b[0][0]
____________________________________________________________________________________________________
res4e_branch2c (Convolution1D)	 (None, 63, 1024)      263168	   activation_36[0][0]
____________________________________________________________________________________________________
bn4e_branch2c (BatchNormalizatio (None, 63, 1024)      4096	   res4e_branch2c[0][0]
____________________________________________________________________________________________________
merge_12 (Merge)		 (None, 63, 1024)      0	   bn4e_branch2c[0][0]
								   activation_34[0][0]
____________________________________________________________________________________________________
activation_37 (Activation)	 (None, 63, 1024)      0	   merge_12[0][0]
____________________________________________________________________________________________________
res4f_branch2a (Convolution1D)	 (None, 63, 256)       262400	   activation_37[0][0]
____________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizatio (None, 63, 256)       1024	   res4f_branch2a[0][0]
____________________________________________________________________________________________________
activation_38 (Activation)	 (None, 63, 256)       0	   bn4f_branch2a[0][0]
____________________________________________________________________________________________________
res4f_branch2b (Convolution1D)	 (None, 63, 256)       196864	   activation_38[0][0]
____________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizatio (None, 63, 256)       1024	   res4f_branch2b[0][0]
____________________________________________________________________________________________________
activation_39 (Activation)	 (None, 63, 256)       0	   bn4f_branch2b[0][0]
____________________________________________________________________________________________________
res4f_branch2c (Convolution1D)	 (None, 63, 1024)      263168	   activation_39[0][0]
____________________________________________________________________________________________________
bn4f_branch2c (BatchNormalizatio (None, 63, 1024)      4096	   res4f_branch2c[0][0]
____________________________________________________________________________________________________
merge_13 (Merge)		 (None, 63, 1024)      0	   bn4f_branch2c[0][0]
								   activation_37[0][0]
____________________________________________________________________________________________________
activation_40 (Activation)	 (None, 63, 1024)      0	   merge_13[0][0]
____________________________________________________________________________________________________
res5a_branch2a (Convolution1D)	 (None, 32, 512)       524800	   activation_40[0][0]
____________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizatio (None, 32, 512)       2048	   res5a_branch2a[0][0]
____________________________________________________________________________________________________
activation_41 (Activation)	 (None, 32, 512)       0	   bn5a_branch2a[0][0]
____________________________________________________________________________________________________
res5a_branch2b (Convolution1D)	 (None, 32, 512)       786944	   activation_41[0][0]
____________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizatio (None, 32, 512)       2048	   res5a_branch2b[0][0]
____________________________________________________________________________________________________
activation_42 (Activation)	 (None, 32, 512)       0	   bn5a_branch2b[0][0]
____________________________________________________________________________________________________
dropout_5 (Dropout)		 (None, 32, 512)       0	   activation_42[0][0]
____________________________________________________________________________________________________
res5a_branch2c (Convolution1D)	 (None, 32, 2048)      1050624	   dropout_5[0][0]
____________________________________________________________________________________________________
res5a_branch1 (Convolution1D)	 (None, 32, 2048)      2099200	   activation_40[0][0]
____________________________________________________________________________________________________
bn5a_branch2c (BatchNormalizatio (None, 32, 2048)      8192	   res5a_branch2c[0][0]
____________________________________________________________________________________________________
bn5a_branch1 (BatchNormalization (None, 32, 2048)      8192	   res5a_branch1[0][0]
____________________________________________________________________________________________________
merge_14 (Merge)		 (None, 32, 2048)      0	   bn5a_branch2c[0][0]
								   bn5a_branch1[0][0]
____________________________________________________________________________________________________
activation_43 (Activation)	 (None, 32, 2048)      0	   merge_14[0][0]
____________________________________________________________________________________________________
res5b_branch2a (Convolution1D)	 (None, 32, 512)       1049088	   activation_43[0][0]
____________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizatio (None, 32, 512)       2048	   res5b_branch2a[0][0]
____________________________________________________________________________________________________
activation_44 (Activation)	 (None, 32, 512)       0	   bn5b_branch2a[0][0]
____________________________________________________________________________________________________
res5b_branch2b (Convolution1D)	 (None, 32, 512)       786944	   activation_44[0][0]
____________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizatio (None, 32, 512)       2048	   res5b_branch2b[0][0]
____________________________________________________________________________________________________
activation_45 (Activation)	 (None, 32, 512)       0	   bn5b_branch2b[0][0]
____________________________________________________________________________________________________
res5b_branch2c (Convolution1D)	 (None, 32, 2048)      1050624	   activation_45[0][0]
____________________________________________________________________________________________________
bn5b_branch2c (BatchNormalizatio (None, 32, 2048)      8192	   res5b_branch2c[0][0]
____________________________________________________________________________________________________
merge_15 (Merge)		 (None, 32, 2048)      0	   bn5b_branch2c[0][0]
								   activation_43[0][0]
____________________________________________________________________________________________________
activation_46 (Activation)	 (None, 32, 2048)      0	   merge_15[0][0]
____________________________________________________________________________________________________
res5c_branch2a (Convolution1D)	 (None, 32, 512)       1049088	   activation_46[0][0]
____________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizatio (None, 32, 512)       2048	   res5c_branch2a[0][0]
____________________________________________________________________________________________________
activation_47 (Activation)	 (None, 32, 512)       0	   bn5c_branch2a[0][0]
____________________________________________________________________________________________________
res5c_branch2b (Convolution1D)	 (None, 32, 512)       786944	   activation_47[0][0]
____________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizatio (None, 32, 512)       2048	   res5c_branch2b[0][0]
____________________________________________________________________________________________________
activation_48 (Activation)	 (None, 32, 512)       0	   bn5c_branch2b[0][0]
____________________________________________________________________________________________________
res5c_branch2c (Convolution1D)	 (None, 32, 2048)      1050624	   activation_48[0][0]
____________________________________________________________________________________________________
bn5c_branch2c (BatchNormalizatio (None, 32, 2048)      8192	   res5c_branch2c[0][0]
____________________________________________________________________________________________________
merge_16 (Merge)		 (None, 32, 2048)      0	   bn5c_branch2c[0][0]
								   activation_46[0][0]
____________________________________________________________________________________________________
activation_49 (Activation)	 (None, 32, 2048)      0	   merge_16[0][0]
____________________________________________________________________________________________________
avg_pool (AveragePooling1D)	 (None, 4, 2048)       0	   activation_49[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)		 (None, 8192)	       0	   avg_pool[0][0]
____________________________________________________________________________________________________
fc1 (Dense)			 (None, 919)	       7529367	   flatten_1[0][0]
====================================================================================================
Total params: 23,564,631
Trainable params: 7,529,367
Non-trainable params: 16,035,264
____________________________________________________________________________________________________
Saving models in json and yaml format to models/json/res_net_2.json and  models/yaml/res_net_2.yaml
Saving weights to models/weights/res_net_2.hdf5 and epoch logs to models/csv/res_net_2.csv
Saving models/json/res_net_2.json to models/json/res_net_2.json.old
Saving models/yaml/res_net_2.yaml to models/yaml/res_net_2.yaml.old
Retrieving train, validation, and test data

The date is 02/25/2017
The time is 03:45:53 AM

Saving models/csv/res_net_2.csv to models/csv/res_net_2.csv.old
Run `tensorboard --logdir=models/run_logs/tensorboard` to open tensorboard at (default) 127.0.0.1:6006
Running at most 70 epochs
Epoch 1/70
2199900/2200000 [============================>.] - ETA: 0ss--loss::0.25587--acc::0.9784Epoch 00000: val_loss improved from inf to 0.27004, saving model to models/weights/res_net_2.hdf5
2200000/2200000 [==============================] - 2840s - loss: 0.2558 - acc: 0.9784 - val_loss: 0.2700 - val_acc: 0.9805
Epoch 2/70
2199900/2200000 [============================>.] - ETA: 0ss--loss::0.31423--acc::0.9784Epoch 00001: val_loss did not improve
2200000/2200000 [==============================] - 2821s - loss: 0.3142 - acc: 0.9784 - val_loss: 0.2902 - val_acc: 0.9805
Epoch 3/70
2199900/2200000 [============================>.] - ETA: 0ss--loss::0.32755--acc::0.9784Epoch 00002: val_loss did not improve
2200000/2200000 [==============================] - 2807s - loss: 0.3275 - acc: 0.9784 - val_loss: 0.3001 - val_acc: 0.9802
Epoch 4/70
2199900/2200000 [============================>.] - ETA: 0ss--loss::0.33277--acc::0.9784Epoch 00003: val_loss did not improve
2200000/2200000 [==============================] - 2779s - loss: 0.3327 - acc: 0.9784 - val_loss: 0.2997 - val_acc: 0.9805
Epoch 5/70
2199900/2200000 [============================>.] - ETA: 0ss--loss::0.33288--acc::0.9784Epoch 00004: val_loss did not improve
2200000/2200000 [==============================] - 2739s - loss: 0.3328 - acc: 0.9784 - val_loss: 0.3004 - val_acc: 0.9803
Epoch 6/70
2199900/2200000 [============================>.] - ETA: 0ss--loss::0.33333--acc::0.9784Epoch 00005: val_loss did not improve
2200000/2200000 [==============================] - 2701s - loss: 0.3333 - acc: 0.9784 - val_loss: 0.3009 - val_acc: 0.9805
Epoch 7/70
2199900/2200000 [============================>.] - ETA: 0ss--loss::0.33411--acc::0.9784Epoch 00006: val_loss did not improve
2200000/2200000 [==============================] - 2663s - loss: 0.3341 - acc: 0.9784 - val_loss: 0.3011 - val_acc: 0.9805
Epoch 00006: early stopping

The date is 02/25/2017
The time is 09:09:00 AM

