Retrieving train, validation, and test data
Building the model
Compiling model
Saving models in json and yaml format to models/json/test_dense_he_normal.json and  models/yaml/test_dense_he_normal.yaml
Saving weights to models/weights/test_dense_he_normal.hdf5 and epoch logs to models/run_logs/test_dense_he_normal.csv
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
convolution1d_1 (Convolution1D)  (None, 998, 128)      1664        convolution1d_input_1[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 998, 128)      0           convolution1d_1[0][0]
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 998, 128)      512         activation_1[0][0]
____________________________________________________________________________________________________
maxpooling1d_1 (MaxPooling1D)    (None, 499, 128)      0           batchnormalization_1[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 499, 128)      0           maxpooling1d_1[0][0]
____________________________________________________________________________________________________
convolution1d_2 (Convolution1D)  (None, 497, 256)      98560       dropout_1[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 497, 256)      0           convolution1d_2[0][0]
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 497, 256)      1024        activation_2[0][0]
____________________________________________________________________________________________________
maxpooling1d_2 (MaxPooling1D)    (None, 248, 256)      0           batchnormalization_2[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 248, 256)      0           maxpooling1d_2[0][0]
____________________________________________________________________________________________________
convolution1d_3 (Convolution1D)  (None, 244, 512)      655872      dropout_2[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 244, 512)      0           convolution1d_3[0][0]
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 244, 512)      2048        activation_3[0][0]
____________________________________________________________________________________________________
maxpooling1d_3 (MaxPooling1D)    (None, 122, 512)      0           batchnormalization_3[0][0]
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 122, 512)      0           maxpooling1d_3[0][0]
____________________________________________________________________________________________________
convolution1d_4 (Convolution1D)  (None, 118, 512)      1311232     dropout_3[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 118, 512)      0           convolution1d_4[0][0]
____________________________________________________________________________________________________
maxpooling1d_4 (MaxPooling1D)    (None, 59, 512)       0           activation_4[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 30208)         0           maxpooling1d_4[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 1024)          30934016    flatten_1[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 1024)          0           dense_1[0][0]
____________________________________________________________________________________________________
batchnormalization_4 (BatchNorma (None, 1024)          4096        activation_5[0][0]
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 1024)          0           batchnormalization_4[0][0]
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 919)           941975      dropout_4[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 919)           0           dense_2[0][0]
====================================================================================================
Total params: 33,950,999
Trainable params: 33,947,159
Non-trainable params: 3,840
____________________________________________________________________________________________________

The date is 02/11/2017
The time is 09:24:50 AM

Loading weights from models/weights/test_dense_he_normal.hdf5 if it exists
Running at most 70 epochs
Train on 2200000 samples, validate on 8000 samples
Epoch 1/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0779 - acc: 0.9775Epoch 00000: val_loss improved from inf to 0.05999, saving model to models/weights/test_dense_he_normal.hdf5
2200000/2200000 [==============================] - 5278s - loss: 0.0779 - acc: 0.9775 - val_loss: 0.0600 - val_acc: 0.9823
Epoch 2/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0683 - acc: 0.9799Epoch 00001: val_loss improved from 0.05999 to 0.05872, saving model to models/weights/test_dense_he_normal.hdf5
2200000/2200000 [==============================] - 5277s - loss: 0.0683 - acc: 0.9799 - val_loss: 0.0587 - val_acc: 0.9828
Epoch 3/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0663 - acc: 0.9801Epoch 00002: val_loss did not improve
2200000/2200000 [==============================] - 5276s - loss: 0.0663 - acc: 0.9801 - val_loss: 0.0594 - val_acc: 0.9825
Epoch 4/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0650 - acc: 0.9803Epoch 00003: val_loss improved from 0.05872 to 0.05632, saving model to models/weights/test_dense_he_normal.hdf5
2200000/2200000 [==============================] - 5274s - loss: 0.0650 - acc: 0.9803 - val_loss: 0.0563 - val_acc: 0.9829
Epoch 5/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0640 - acc: 0.9805Epoch 00004: val_loss did not improve
2200000/2200000 [==============================] - 5272s - loss: 0.0640 - acc: 0.9805 - val_loss: 0.0577 - val_acc: 0.9826
Epoch 6/70
2199600/2200000 [============================>.] - ETA: 0s - loss: 0.0632 - acc: 0.9806Epoch 00005: val_loss improved from 0.05632 to 0.05624, saving model to models/weights/test_dense_he_normal.hdf5
2200000/2200000 [==============================] - 5273s - loss: 0.0632 - acc: 0.9806 - val_loss: 0.0562 - val_acc: 0.9828
