Retrieving train, validation, and test data
Building the model
Saving models in json and yaml format to models/json/vgg_net_1.json and  models/yaml/vgg_net_1.yaml
Saving weights to models/weights/vgg_net_1.hdf5 and epoch logs to models/run_logs/vgg_net_1.csv
Loading weights from models/weights/vgg_net_1.hdf5 if it exists
Retrieving train, validation, and test data
Building the model
Saving models in json and yaml format to models/json/vgg_net_1.json and  models/yaml/vgg_net_1.yaml
Saving weights to models/weights/vgg_net_1.hdf5 and epoch logs to models/run_logs/vgg_net_1.csv
Saving models/json/vgg_net_1.json to models/json/vgg_net_1.json.old
Saving models/yaml/vgg_net_1.yaml to models/yaml/vgg_net_1.yaml.old
____________________________________________________________________________________________________
Layer (type)			 Output Shape	       Param #	   Connected to
====================================================================================================
convolution1d_1 (Convolution1D)  (None, 1000, 64)      832	   convolution1d_input_1[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)	 (None, 1000, 64)      0	   convolution1d_1[0][0]
____________________________________________________________________________________________________
convolution1d_2 (Convolution1D)  (None, 1000, 64)      12352	   activation_1[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)	 (None, 1000, 64)      0	   convolution1d_2[0][0]
____________________________________________________________________________________________________
maxpooling1d_1 (MaxPooling1D)	 (None, 500, 64)       0	   activation_2[0][0]
____________________________________________________________________________________________________
convolution1d_3 (Convolution1D)  (None, 500, 128)      24704	   maxpooling1d_1[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)	 (None, 500, 128)      0	   convolution1d_3[0][0]
____________________________________________________________________________________________________
convolution1d_4 (Convolution1D)  (None, 500, 128)      49280	   activation_3[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)	 (None, 500, 128)      0	   convolution1d_4[0][0]
____________________________________________________________________________________________________
maxpooling1d_2 (MaxPooling1D)	 (None, 250, 128)      0	   activation_4[0][0]
____________________________________________________________________________________________________
convolution1d_5 (Convolution1D)  (None, 250, 256)      98560	   maxpooling1d_2[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)	 (None, 250, 256)      0	   convolution1d_5[0][0]
____________________________________________________________________________________________________
convolution1d_6 (Convolution1D)  (None, 250, 256)      196864	   activation_5[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)	 (None, 250, 256)      0	   convolution1d_6[0][0]
____________________________________________________________________________________________________
convolution1d_7 (Convolution1D)  (None, 250, 256)      196864	   activation_6[0][0]
____________________________________________________________________________________________________
activation_7 (Activation)	 (None, 250, 256)      0	   convolution1d_7[0][0]
____________________________________________________________________________________________________
maxpooling1d_3 (MaxPooling1D)	 (None, 125, 256)      0	   activation_7[0][0]
____________________________________________________________________________________________________
convolution1d_8 (Convolution1D)  (None, 125, 512)      393728	   maxpooling1d_3[0][0]
____________________________________________________________________________________________________
activation_8 (Activation)	 (None, 125, 512)      0	   convolution1d_8[0][0]
____________________________________________________________________________________________________
convolution1d_9 (Convolution1D)  (None, 125, 512)      786944	   activation_8[0][0]
____________________________________________________________________________________________________
activation_9 (Activation)	 (None, 125, 512)      0	   convolution1d_9[0][0]
____________________________________________________________________________________________________
convolution1d_10 (Convolution1D) (None, 125, 512)      786944	   activation_9[0][0]
____________________________________________________________________________________________________
activation_10 (Activation)	 (None, 125, 512)      0	   convolution1d_10[0][0]
____________________________________________________________________________________________________
maxpooling1d_4 (MaxPooling1D)	 (None, 62, 512)       0	   activation_10[0][0]
____________________________________________________________________________________________________
convolution1d_11 (Convolution1D) (None, 62, 512)       786944	   maxpooling1d_4[0][0]
____________________________________________________________________________________________________
activation_11 (Activation)	 (None, 62, 512)       0	   convolution1d_11[0][0]
____________________________________________________________________________________________________
convolution1d_12 (Convolution1D) (None, 62, 512)       786944	   activation_11[0][0]
____________________________________________________________________________________________________
activation_12 (Activation)	 (None, 62, 512)       0	   convolution1d_12[0][0]
____________________________________________________________________________________________________
convolution1d_13 (Convolution1D) (None, 62, 512)       786944	   activation_12[0][0]
____________________________________________________________________________________________________
activation_13 (Activation)	 (None, 62, 512)       0	   convolution1d_13[0][0]
____________________________________________________________________________________________________
maxpooling1d_5 (MaxPooling1D)	 (None, 31, 512)       0	   activation_13[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)		 (None, 15872)	       0	   maxpooling1d_5[0][0]
____________________________________________________________________________________________________
dense_1 (Dense) 		 (None, 4000)	       63492000    flatten_1[0][0]
____________________________________________________________________________________________________
activation_14 (Activation)	 (None, 4000)	       0	   dense_1[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)		 (None, 4000)	       0	   activation_14[0][0]
____________________________________________________________________________________________________
dense_2 (Dense) 		 (None, 4000)	       16004000    dropout_1[0][0]
____________________________________________________________________________________________________
activation_15 (Activation)	 (None, 4000)	       0	   dense_2[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)		 (None, 4000)	       0	   activation_15[0][0]
____________________________________________________________________________________________________
dense_3 (Dense) 		 (None, 919)	       3676919	   dropout_2[0][0]
____________________________________________________________________________________________________
activation_16 (Activation)	 (None, 919)	       0	   dense_3[0][0]
====================================================================================================
Total params: 88,080,823
Trainable params: 88,080,823
Non-trainable params: 0
____________________________________________________________________________________________________

The date is 02/09/2017
The time is 07:30:42 PM

Loading weights from models/weights/vgg_net_1.hdf5 if it exists
Retrieving train, validation, and test data
Building the model
Saving models in json and yaml format to models/json/vgg_net_1.json and  models/yaml/vgg_net_1.yaml
Saving weights to models/weights/vgg_net_1.hdf5 and epoch logs to models/run_logs/vgg_net_1.csv
Saving models/json/vgg_net_1.json to models/json/vgg_net_1.json.old
Saving models/yaml/vgg_net_1.yaml to models/yaml/vgg_net_1.yaml.old
____________________________________________________________________________________________________
Layer (type)			 Output Shape	       Param #	   Connected to
====================================================================================================
convolution1d_1 (Convolution1D)  (None, 1000, 64)      832	   convolution1d_input_1[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)	 (None, 1000, 64)      0	   convolution1d_1[0][0]
____________________________________________________________________________________________________
convolution1d_2 (Convolution1D)  (None, 1000, 64)      12352	   activation_1[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)	 (None, 1000, 64)      0	   convolution1d_2[0][0]
____________________________________________________________________________________________________
maxpooling1d_1 (MaxPooling1D)	 (None, 500, 64)       0	   activation_2[0][0]
____________________________________________________________________________________________________
convolution1d_3 (Convolution1D)  (None, 500, 128)      24704	   maxpooling1d_1[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)	 (None, 500, 128)      0	   convolution1d_3[0][0]
____________________________________________________________________________________________________
convolution1d_4 (Convolution1D)  (None, 500, 128)      49280	   activation_3[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)	 (None, 500, 128)      0	   convolution1d_4[0][0]
____________________________________________________________________________________________________
maxpooling1d_2 (MaxPooling1D)	 (None, 250, 128)      0	   activation_4[0][0]
____________________________________________________________________________________________________
convolution1d_5 (Convolution1D)  (None, 250, 256)      98560	   maxpooling1d_2[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)	 (None, 250, 256)      0	   convolution1d_5[0][0]
____________________________________________________________________________________________________
convolution1d_6 (Convolution1D)  (None, 250, 256)      196864	   activation_5[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)	 (None, 250, 256)      0	   convolution1d_6[0][0]
____________________________________________________________________________________________________
convolution1d_7 (Convolution1D)  (None, 250, 256)      196864	   activation_6[0][0]
____________________________________________________________________________________________________
activation_7 (Activation)	 (None, 250, 256)      0	   convolution1d_7[0][0]
____________________________________________________________________________________________________
maxpooling1d_3 (MaxPooling1D)	 (None, 125, 256)      0	   activation_7[0][0]
____________________________________________________________________________________________________
convolution1d_8 (Convolution1D)  (None, 125, 512)      393728	   maxpooling1d_3[0][0]
____________________________________________________________________________________________________
activation_8 (Activation)	 (None, 125, 512)      0	   convolution1d_8[0][0]
____________________________________________________________________________________________________
convolution1d_9 (Convolution1D)  (None, 125, 512)      786944	   activation_8[0][0]
____________________________________________________________________________________________________
activation_9 (Activation)	 (None, 125, 512)      0	   convolution1d_9[0][0]
____________________________________________________________________________________________________
convolution1d_10 (Convolution1D) (None, 125, 512)      786944	   activation_9[0][0]
____________________________________________________________________________________________________
activation_10 (Activation)	 (None, 125, 512)      0	   convolution1d_10[0][0]
____________________________________________________________________________________________________
maxpooling1d_4 (MaxPooling1D)	 (None, 62, 512)       0	   activation_10[0][0]
____________________________________________________________________________________________________
convolution1d_11 (Convolution1D) (None, 62, 512)       786944	   maxpooling1d_4[0][0]
____________________________________________________________________________________________________
activation_11 (Activation)	 (None, 62, 512)       0	   convolution1d_11[0][0]
____________________________________________________________________________________________________
convolution1d_12 (Convolution1D) (None, 62, 512)       786944	   activation_11[0][0]
____________________________________________________________________________________________________
activation_12 (Activation)	 (None, 62, 512)       0	   convolution1d_12[0][0]
____________________________________________________________________________________________________
convolution1d_13 (Convolution1D) (None, 62, 512)       786944	   activation_12[0][0]
____________________________________________________________________________________________________
activation_13 (Activation)	 (None, 62, 512)       0	   convolution1d_13[0][0]
____________________________________________________________________________________________________
maxpooling1d_5 (MaxPooling1D)	 (None, 31, 512)       0	   activation_13[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)		 (None, 15872)	       0	   maxpooling1d_5[0][0]
____________________________________________________________________________________________________
dense_1 (Dense) 		 (None, 4000)	       63492000    flatten_1[0][0]
____________________________________________________________________________________________________
activation_14 (Activation)	 (None, 4000)	       0	   dense_1[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)		 (None, 4000)	       0	   activation_14[0][0]
____________________________________________________________________________________________________
dense_2 (Dense) 		 (None, 4000)	       16004000    dropout_1[0][0]
____________________________________________________________________________________________________
activation_15 (Activation)	 (None, 4000)	       0	   dense_2[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)		 (None, 4000)	       0	   activation_15[0][0]
____________________________________________________________________________________________________
dense_3 (Dense) 		 (None, 919)	       3676919	   dropout_2[0][0]
____________________________________________________________________________________________________
activation_16 (Activation)	 (None, 919)	       0	   dense_3[0][0]
====================================================================================================
Total params: 88,080,823
Trainable params: 88,080,823
Non-trainable params: 0
____________________________________________________________________________________________________

The date is 02/09/2017
The time is 07:32:01 PM

Loading weights from models/weights/vgg_net_1.hdf5 if it exists
Retrieving train, validation, and test data
Building the model
Saving models in json and yaml format to models/json/vgg_net_1.json and  models/yaml/vgg_net_1.yaml
Saving weights to models/weights/vgg_net_1.hdf5 and epoch logs to models/run_logs/vgg_net_1.csv
Saving models/json/vgg_net_1.json to models/json/vgg_net_1.json.old
Saving models/yaml/vgg_net_1.yaml to models/yaml/vgg_net_1.yaml.old
____________________________________________________________________________________________________
Layer (type)			 Output Shape	       Param #	   Connected to
====================================================================================================
convolution1d_1 (Convolution1D)  (None, 1000, 64)      832	   convolution1d_input_1[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)	 (None, 1000, 64)      0	   convolution1d_1[0][0]
____________________________________________________________________________________________________
convolution1d_2 (Convolution1D)  (None, 1000, 64)      12352	   activation_1[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)	 (None, 1000, 64)      0	   convolution1d_2[0][0]
____________________________________________________________________________________________________
maxpooling1d_1 (MaxPooling1D)	 (None, 500, 64)       0	   activation_2[0][0]
____________________________________________________________________________________________________
convolution1d_3 (Convolution1D)  (None, 500, 128)      24704	   maxpooling1d_1[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)	 (None, 500, 128)      0	   convolution1d_3[0][0]
____________________________________________________________________________________________________
convolution1d_4 (Convolution1D)  (None, 500, 128)      49280	   activation_3[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)	 (None, 500, 128)      0	   convolution1d_4[0][0]
____________________________________________________________________________________________________
maxpooling1d_2 (MaxPooling1D)	 (None, 250, 128)      0	   activation_4[0][0]
____________________________________________________________________________________________________
convolution1d_5 (Convolution1D)  (None, 250, 256)      98560	   maxpooling1d_2[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)	 (None, 250, 256)      0	   convolution1d_5[0][0]
____________________________________________________________________________________________________
convolution1d_6 (Convolution1D)  (None, 250, 256)      196864	   activation_5[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)	 (None, 250, 256)      0	   convolution1d_6[0][0]
____________________________________________________________________________________________________
convolution1d_7 (Convolution1D)  (None, 250, 256)      196864	   activation_6[0][0]
____________________________________________________________________________________________________
activation_7 (Activation)	 (None, 250, 256)      0	   convolution1d_7[0][0]
____________________________________________________________________________________________________
maxpooling1d_3 (MaxPooling1D)	 (None, 125, 256)      0	   activation_7[0][0]
____________________________________________________________________________________________________
convolution1d_8 (Convolution1D)  (None, 125, 512)      393728	   maxpooling1d_3[0][0]
____________________________________________________________________________________________________
activation_8 (Activation)	 (None, 125, 512)      0	   convolution1d_8[0][0]
____________________________________________________________________________________________________
convolution1d_9 (Convolution1D)  (None, 125, 512)      786944	   activation_8[0][0]
____________________________________________________________________________________________________
activation_9 (Activation)	 (None, 125, 512)      0	   convolution1d_9[0][0]
____________________________________________________________________________________________________
convolution1d_10 (Convolution1D) (None, 125, 512)      786944	   activation_9[0][0]
____________________________________________________________________________________________________
activation_10 (Activation)	 (None, 125, 512)      0	   convolution1d_10[0][0]
____________________________________________________________________________________________________
maxpooling1d_4 (MaxPooling1D)	 (None, 62, 512)       0	   activation_10[0][0]
____________________________________________________________________________________________________
convolution1d_11 (Convolution1D) (None, 62, 512)       786944	   maxpooling1d_4[0][0]
____________________________________________________________________________________________________
activation_11 (Activation)	 (None, 62, 512)       0	   convolution1d_11[0][0]
____________________________________________________________________________________________________
convolution1d_12 (Convolution1D) (None, 62, 512)       786944	   activation_11[0][0]
____________________________________________________________________________________________________
activation_12 (Activation)	 (None, 62, 512)       0	   convolution1d_12[0][0]
____________________________________________________________________________________________________
convolution1d_13 (Convolution1D) (None, 62, 512)       786944	   activation_12[0][0]
____________________________________________________________________________________________________
activation_13 (Activation)	 (None, 62, 512)       0	   convolution1d_13[0][0]
____________________________________________________________________________________________________
maxpooling1d_5 (MaxPooling1D)	 (None, 31, 512)       0	   activation_13[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)		 (None, 15872)	       0	   maxpooling1d_5[0][0]
____________________________________________________________________________________________________
dense_1 (Dense) 		 (None, 4000)	       63492000    flatten_1[0][0]
____________________________________________________________________________________________________
activation_14 (Activation)	 (None, 4000)	       0	   dense_1[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)		 (None, 4000)	       0	   activation_14[0][0]
____________________________________________________________________________________________________
dense_2 (Dense) 		 (None, 4000)	       16004000    dropout_1[0][0]
____________________________________________________________________________________________________
activation_15 (Activation)	 (None, 4000)	       0	   dense_2[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)		 (None, 4000)	       0	   activation_15[0][0]
____________________________________________________________________________________________________
dense_3 (Dense) 		 (None, 919)	       3676919	   dropout_2[0][0]
____________________________________________________________________________________________________
activation_16 (Activation)	 (None, 919)	       0	   dense_3[0][0]
====================================================================================================
Total params: 88,080,823
Trainable params: 88,080,823
Non-trainable params: 0
____________________________________________________________________________________________________

The date is 02/09/2017
The time is 07:56:58 PM

Loading weights from models/weights/vgg_net_1.hdf5 if it exists
Running at most 70 epochs
Retrieving train, validation, and test data
Building the model
Saving models in json and yaml format to models/json/vgg_net_1.json and  models/yaml/vgg_net_1.yaml
Saving weights to models/weights/vgg_net_1.hdf5 and epoch logs to models/run_logs/vgg_net_1.csv
Saving models/json/vgg_net_1.json to models/json/vgg_net_1.json.old
Saving models/yaml/vgg_net_1.yaml to models/yaml/vgg_net_1.yaml.old
____________________________________________________________________________________________________
Layer (type)			 Output Shape	       Param #	   Connected to
====================================================================================================
convolution1d_1 (Convolution1D)  (None, 1000, 64)      832	   convolution1d_input_1[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)	 (None, 1000, 64)      0	   convolution1d_1[0][0]
____________________________________________________________________________________________________
convolution1d_2 (Convolution1D)  (None, 1000, 64)      12352	   activation_1[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)	 (None, 1000, 64)      0	   convolution1d_2[0][0]
____________________________________________________________________________________________________
maxpooling1d_1 (MaxPooling1D)	 (None, 500, 64)       0	   activation_2[0][0]
____________________________________________________________________________________________________
convolution1d_3 (Convolution1D)  (None, 500, 128)      24704	   maxpooling1d_1[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)	 (None, 500, 128)      0	   convolution1d_3[0][0]
____________________________________________________________________________________________________
convolution1d_4 (Convolution1D)  (None, 500, 128)      49280	   activation_3[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)	 (None, 500, 128)      0	   convolution1d_4[0][0]
____________________________________________________________________________________________________
maxpooling1d_2 (MaxPooling1D)	 (None, 250, 128)      0	   activation_4[0][0]
____________________________________________________________________________________________________
convolution1d_5 (Convolution1D)  (None, 250, 256)      98560	   maxpooling1d_2[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)	 (None, 250, 256)      0	   convolution1d_5[0][0]
____________________________________________________________________________________________________
convolution1d_6 (Convolution1D)  (None, 250, 256)      196864	   activation_5[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)	 (None, 250, 256)      0	   convolution1d_6[0][0]
____________________________________________________________________________________________________
convolution1d_7 (Convolution1D)  (None, 250, 256)      196864	   activation_6[0][0]
____________________________________________________________________________________________________
activation_7 (Activation)	 (None, 250, 256)      0	   convolution1d_7[0][0]
____________________________________________________________________________________________________
maxpooling1d_3 (MaxPooling1D)	 (None, 125, 256)      0	   activation_7[0][0]
____________________________________________________________________________________________________
convolution1d_8 (Convolution1D)  (None, 125, 512)      393728	   maxpooling1d_3[0][0]
____________________________________________________________________________________________________
activation_8 (Activation)	 (None, 125, 512)      0	   convolution1d_8[0][0]
____________________________________________________________________________________________________
convolution1d_9 (Convolution1D)  (None, 125, 512)      786944	   activation_8[0][0]
____________________________________________________________________________________________________
activation_9 (Activation)	 (None, 125, 512)      0	   convolution1d_9[0][0]
____________________________________________________________________________________________________
convolution1d_10 (Convolution1D) (None, 125, 512)      786944	   activation_9[0][0]
____________________________________________________________________________________________________
activation_10 (Activation)	 (None, 125, 512)      0	   convolution1d_10[0][0]
____________________________________________________________________________________________________
maxpooling1d_4 (MaxPooling1D)	 (None, 62, 512)       0	   activation_10[0][0]
____________________________________________________________________________________________________
convolution1d_11 (Convolution1D) (None, 62, 512)       786944	   maxpooling1d_4[0][0]
____________________________________________________________________________________________________
activation_11 (Activation)	 (None, 62, 512)       0	   convolution1d_11[0][0]
____________________________________________________________________________________________________
convolution1d_12 (Convolution1D) (None, 62, 512)       786944	   activation_11[0][0]
____________________________________________________________________________________________________
activation_12 (Activation)	 (None, 62, 512)       0	   convolution1d_12[0][0]
____________________________________________________________________________________________________
convolution1d_13 (Convolution1D) (None, 62, 512)       786944	   activation_12[0][0]
____________________________________________________________________________________________________
activation_13 (Activation)	 (None, 62, 512)       0	   convolution1d_13[0][0]
____________________________________________________________________________________________________
maxpooling1d_5 (MaxPooling1D)	 (None, 31, 512)       0	   activation_13[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)		 (None, 15872)	       0	   maxpooling1d_5[0][0]
____________________________________________________________________________________________________
dense_1 (Dense) 		 (None, 4000)	       63492000    flatten_1[0][0]
____________________________________________________________________________________________________
activation_14 (Activation)	 (None, 4000)	       0	   dense_1[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)		 (None, 4000)	       0	   activation_14[0][0]
____________________________________________________________________________________________________
dense_2 (Dense) 		 (None, 4000)	       16004000    dropout_1[0][0]
____________________________________________________________________________________________________
activation_15 (Activation)	 (None, 4000)	       0	   dense_2[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)		 (None, 4000)	       0	   activation_15[0][0]
____________________________________________________________________________________________________
dense_3 (Dense) 		 (None, 919)	       3676919	   dropout_2[0][0]
____________________________________________________________________________________________________
activation_16 (Activation)	 (None, 919)	       0	   dense_3[0][0]
====================================================================================================
Total params: 88,080,823
Trainable params: 88,080,823
Non-trainable params: 0
____________________________________________________________________________________________________

The date is 02/09/2017
The time is 07:59:15 PM

Loading weights from models/weights/vgg_net_1.hdf5 if it exists
Running at most 70 epochs
